<html>
<head>
<meta http-equiv="content-Type" content="text/html;charset=utf-8" />
<meta name="keywords" content="BlueBrick, Help">
<meta name="description" content="La documentation de r&eacute;f&eacute;rence pour BlueBrick.">
<meta name="author" content="Alban Nanty">
<META NAME="translator" CONTENT="Gr&eacute;gory Lambert">
<link rel="StyleSheet" href="../BlueBrick.css" type="text/css" media="screen">
<title>Non affiché dans la bibliothèque</title>
</head>
<body>
<h1>Non affiché dans la bibliothèque</h1>

<table class="XMLDescription">
<tr>
	<td class="Tilte">Syntaxe&nbsp;:</td>
	<td class="XMLCode">&lt;NotListedInLibrary&gt;...&lt;/NotListedInLibrary&gt;</td>
</tr><tr>
	<td class="Tilte">Valeur par d&eacute;faut&nbsp;:</td>
	<td>false</td>
</tr><tr>
	<td class="Tilte">Description&nbsp;:</td>
	<td>Si ce label est position&eacute; &agrave; "true", la pi&egrave;ce ne sera pas visible dans la biblioth&egrave;que de pi&egrave;ces de l'application.</td>
</tr>  
</table>

<p>La plupart des pi&egrave;ces ne devraient pas avoir besoin de ce label. Si ce label est positionn&eacute; &agrave; "true" (vrai), la pi&egrave;ce ne sera pas visible dans la biblioth&egrave;que des pi&egrave;ces. Si le label est absent ou positionn&eacute; &agrave; "false" (faux), la pi&egrave;ce apparaitra alors normalement dans la biblioth&egrave;que. Ce label est utile lorsque vous souhaitez cr&eacute;er un groupe accessible dans la biblioth&egrave;que pi&egrave;ces mais que vous voulez masquer toutes les sous-pi&egrave;ces du groupe.</p>

<p>A noter que m&ecirc;me si cet indicateur est positionn&eacute; &agrave; true, BlueBrick chargera les images associ&eacute;es (si existantes) ainsi que les propri&eacute;t&eacute;s XML et la pi&egrave;ce sera totallement fonctionnelle (points de connexion, etc.) sur la carte.
En particulier, si vous ajoutez cette pi&egrave;ce via un groupe et ensuite d&eacute;groupez le groupe, vous pourrez manipuler la pi&egrave;ce normallement, comme n'importe quelle autre. Positionner le label &agrave; true bloque uniquement l'affichage de la pi&egrave;ce dans la biblioth&egrave;que ainsi que la possibiliter de la placer sur la carte.</p>

</body>
</html>