<html><head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<meta name="keywords" content="BlueBrick, Aide">
<meta name="description" content="La documentation de r&eacute;f&eacute;rence pour BlueBrick.">
<meta name="author" content="Alban Nanty">
<meta name="translator" content="Gr&eacute;gory Lambert">
<link rel="StyleSheet" href="../BlueBrick.css" type="text/css" media="screen">
<title>Recharger la biblioth&egrave;que de pi&egrave;ces</title>
</head>
<body>
<h1>Recharger la biblioth&egrave;que de pi&egrave;ces</h1>
<p>Cette fonctionnalit&eacute; tr&egrave;s utile a &eacute;t&eacute; demand&eacute;e par les utilisateurs qui cr&eacute;ent de nouvelles pi&egrave;ces pour BlueBrick. 
Cette fonction donne la possibilit&eacute; de charger &agrave; nouveau la biblioth&egrave;que des pi&egrave;ces sans avoir &agrave; fermer et rouvrir l'application &agrave; chaque fois.
C'est accessible depuis le menu <font class="Path">&nbsp;Fichier &gt; Recharger la biblioth&egrave;que&nbsp;</font>.
Comme le d&eacute;marrage de l'application peut n&eacute;cessiter un moment, cela peut vous &eacute;viter de perdre du temps quand vous affinez la conception d'une pi&egrave;ce &eacute;tape par &eacute;tape.
</p>

<p>Pour utiliser cette fonction, s&eacute;lectionnez le menu <font class="Path">&nbsp;Fichier &gt; Recharger la biblioth&egrave;que&nbsp;</font>.
Si vous n'avez pas sauvegard&eacute; votre carte, un message d'alerte sera affich&eacute; car la carte sera "d&eacute;charg&eacute;e" (d&eacute;sactiv&eacute;e) de BlueBrick. 
La biblioth&egrave;que est ensuite d&eacute;sactiv&eacute;e &eacute;galement et une fen&ecirc;tre s'ouvre avec un message vous invitant &agrave; recharger la biblioth&egrave;que lorsque vous &ecirc;tes pr&ecirc;t. 
</p>

<p>En g&eacute;n&eacute;ral, vous ne cliquez pas imm&eacute;diatement sur le bouton: vous pouvez basculer sur une autre application comme votre &eacute;diteur d'image ou un &eacute;diteur XML. Et lorsque la modification de vos fichiers Pi&egrave;ces est termin&eacute;e, vous pouvez cliquer sur le bouton OK dans la fen&ecirc;tre d'information et cela rechargera la biblioth&egrave;que de pi&egrave;ces en m&ecirc;me temps que la derni&egrave;re carte qui &eacute;tait ouverte. 
another application such as your image editor or your XML editor. When 
you have finished modifying your part files, you can click on the ok 
button of the message box, and this will reload the part library as well
</p>

</body></html>