<html>
<head>
<meta name="keywords" content="BlueBrick, Help">
<meta name="description" content="The reference documentation for BlueBrick.">
<meta name="author" content="Alex McKenna">
<meta name="translator" content="Laurent Le Berre">
<link rel=StyleSheet href="../BlueBrick.css" type="text/css" media=screen>
<Title>Les fen&ecirc;tres</Title>
</head>
<body>
<h1>Les fen&ecirc;tres</h1>
<p>L'interface de BlueBrick consiste en ces trois fen&ecirc;tres : la fen&ecirc;tre du plan, la fen&ecirc;tre des pi&egrave;ces, et la fen&ecirc;tre des calques. L'utilisation de ces fen&ecirc;tres sera d&eacute;taill&eacute;e ult&eacute;rieurement, dans la section <a href="Creating_and_Modifying_Models.htm">Cr&eacute;er et modifier des mod&egrave;les</a>.</p>

<CENTER><IMG SRC="WindowPanes.png"></CENTER>

<h2>La fen&ecirc;tre du plan</h2>
<p>La fen&ecirc;tre des calques se trouve sur la partie gauche de l'&eacute;cran, et est reconnaissable &agrave; son fond bleu par d&eacute;faut, et &agrave; sa grille blanche. Cette fen&ecirc;tre dispose d'une option "magn&eacute;tisme" ajustable, qui vous sera utile pour aligner les diff&eacute;rents &eacute;l&eacute;ments sur la grille du plan.</p>

<h2>La fen&ecirc;tre des pi&egrave;ces</h2>
<p>La fen&ecirc;tre des pi&egrave;ces se trouve dans le coin sup&eacute;rieur droit de la fen&ecirc;tre, et consiste en un ensemble de cat&eacute;gories r&eacute;parties en onglets qui organisent les pi&egrave;ces disponibles. Il vous est possible de contribuer &agrave; l'allongement de la liste des pi&egrave;ces en cliquant ici. L'onglet &laquo;&nbsp;Personnaliser&nbsp;&raquo; propose pour l'instant trois diff&eacute;rentes tailles de surface de table. Ces tailles repr&eacute;sentent le nombre de plaques de base Lego 32 x 32 pouvant tenir sur cette surface.</p>

<p>Notez que ces onglets appara&icirc;tront toujours en anglais, quelle que soit la langue s&eacute;lectionn&eacute;e dans le logiciel. La raison en est que les titres reprennent les noms des dossiers o&ugrave; sont situ&eacute;es les pi&egrave;ces. Si vous renommez les sous-dossiers dans le r&eacute;pertoire des pi&egrave;ces de <span class=SpellE>Bluebrick</span>, les changements seront repris dans les titres des onglets.</p>

<p>Un clic droit sur les pi&egrave;ces r&eacute;tr&eacute;cie les vignettes, de sorte &agrave; ce que vous puissiez visualiser davantage de pi&egrave;ces en m&ecirc;me temps.</p>

<h2>La fen&ecirc;tre des calques</h2>

<p>La fen&ecirc;tre des calques se trouve dans le coin inf&eacute;rieur droit de la fen&ecirc;tre. Cette option est particuli&egrave;rement utile pour r&eacute;aliser des plans complexe. Cette fen&ecirc;tre vous permet d'ajouter, d'effacer et de r&eacute;organiser les diff&eacute;rents calques dont vous avez besoin. Davantage de d&eacute;tails sont disponibles dans la section <a href="Creating_and_Using_Layers.htm">Cr&eacute;ation et utilisation des calques</a>.</p>

</body>
</html>