<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alex McKenna">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>A&ntilde;adir y borrar piezas</Title>
</HEAD>
<BODY>
<H1>A&ntilde;adir y borrar piezas</H1>

<BR>
<CENTER><IMG SRC="MainToolbar.png"></CENTER>

<P>Se pueden <B>a&ntilde;adir</B> piezas de 3 maneras diferentes. Se puede hacer simplemente arrastrando la pieza deseada al panel del trazado (v&eacute;ase la secci&oacute;n <A HREF="Window_Panes.htm">Paneles de la ventana</A> para m&aacute;s detalles), o haciendo un clic izquierdo sobre la pieza en el panel de piezas (la pieza se a&ntilde;adir&aacute; a la izquierda de de la selecci&oacute;n activa), o usando un atajo de teclado. Por ejemplo &quot;S&quot; insertar&aacute; una recta de 9V a la izquierda de la selecci&oacute;n activa. Tambi&eacute;n puedes configurar otros atajos de teclado (v&eacute;ase la secci&oacute;n <A HREF="Preferences_Shortcut_Keys.htm">Atajos de teclado</A> para m&aacute;s detalles).</P>

<P>Las funciones Borrar, Cortar, Copiar y Pegar est&aacute;n disponibles con las teclas 6 al 9, adem&aacute;s de los atajos habituales de otros programas.. Por ejemplo, CTRL + C para Copiar y CTRL + V para Pegar. Tambi&eacute;n puedes pegar piezas duplic&aacute;ndolos. Esto se hace seleccionando una pieza, pulsando la tecla de duplicaci&oacute;n (por defecto ALT), luego arrastrando la pieza con el rat&oacute;n y solt&aacute;ndolo donde se quiera colocar. Tambi&eacute;n se pueden cortar o copiar piezas de una capa a otra.</P>

<P><B>Duplicar</B> piezas y texto se puede hacer seleccionando la pieza o texto sin soltar el bot&oacute;n izquierdo, luego pulsar ALT, mover el rat&oacute;n a la ubicaci&oacute;n deseada del duplicado y solt&aacute;ndolo. Al activarse, la funci&oacute;n de duplicado se indica con un peque&ntilde;o &quot;+&quot; al lado del cursor al presionar la tecla ALT (por defecto), cuando el cursor est&aacute; encima de la pieza seleccionada.</P>

<P>Todas estas acciones se pueden deshacer y rehacer, vea la secci&oacute;n <A HREF="Creating_Modifying_Layouts_Undo_and_Redo.htm">Deshacer y rehacer</A> section para m&aacute;s detalles.</P>

</BODY>
</HTML>
