<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alban Nanty">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>Archivo de configuraci&oacute;n del tipo de conexi&oacute;n</Title>
</HEAD>
<BODY>
<H1>Archivo de configuraci&oacute;n del tipo de conexi&oacute;n</H1>
<P>A partir de la versi&oacute;n 1.7 de BlueBrick se pueden ampliar los tipos de conexiones para piezas permitiendo la creaci&oacute;n de un n&uacute;mero infinito de tipos de conexiones. Tambi&eacute;n puedes definir el color y tama&ntilde;o del punto que representa las conexiones libres en Bluebrick.</P>

<P>Todos los diferentes tipos de conexiones se describen en un archivo XML llamado <span class="Important">&quot;ConnectionTypeList.xml&quot;</span> que se encuentra en la carpeta <span class="Important">&quot;config&quot;</span> de tu instalaci&oacute;n de BlueBrick. El archivo tiene la siguiente estructura:</P>

<TABLE CLASS="XMLDescription">
<TR>
	<TD CLASS="Tilte">Conexi&oacute;n seleccionada:</TD>
	<TD CLASS="XMLCode">&lt;SelectedConnection&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;ColorARGB&gt;...&lt;/ColorARGB&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;Size&gt;...&lt;/Size&gt;<BR> &lt;/SelectedConnection&gt;
	</TD>
</TR><TR>
	<TD CLASS="Tilte">Lista de tipos de conexiones:</TD>
	<TD CLASS="XMLCode">&lt;ConnectionTypeList&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;ConnectionType name=&quot;...&quot;&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;ColorARGB&gt;...&lt;/ColorARGB&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;Size&gt;...&lt;/Size&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;HingeAngle&gt;...&lt;/HingeAngle&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;/ConnectionType&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;...<BR> &lt;/ConnectionTypeList&gt;
	</TD>
</TR>  
</TABLE>

<P>El <span class="Important">campon SelectedConnection</span> te permite definir el tama&ntilde;o y el color de la conexi&oacute;n seleccionada cuando haces clic sobre una &uacute;nica pieza. Si este campo no se encuentra en el archivo XML, se mostrar&aacute; un gran punto rojo por defecto. Siempre hay que usar un tama&ntilde;o de punto m&aacute;s grande que cualquiera que puedas definir en la lista de tipos de conexiones, porque la primera vez que se dibuja el punto se hace debajo del punto actual. De modo que si el punto es demasiado peque&ntilde;o el nuevo punto estar&aacute; escondido debajo del punto de conexi&oacute;n.</P>

<P>El <span class="Important">campo ColorARGB</span> es una integral de 4 bites escrita en hexadecimal y el orden de los componentes de color es Alfa (es decir transparencia), Rojo, Verde, Azul. No hay que a&ntilde;adir el prefijo &quot;0x&quot; al n&uacute;mero Por ejemplo, el color verde s&oacute;lido ser&iacute;a <span class="Important">FF00FF00</span>. Si este campo falta se usar&aacute; el color negro s&oacute;lido por defecto. Ten cuidado de no usar un valor cero en el canal Alfa, ya que de hacerlo el punto ser&aacute; totalmente transparente y por tanto invisible.</P>

<P>El <span class="Important">campo Size</span> define el radio del punto en unidades de studs. SI este campo falta se usar&aacute; un radio de 1 stud por defecto.</P>

<P>El <span class="Important">campo HingeAngle</span> define el &aacute;ngulo m&aacute;ximo que pueden girar los bricks mientras est&aacute;n conectados. Este campo puede no aparecer en la conexi&oacute;n seleccionada y es opcional para otras conexiones. Si este campo tiene el valor 0 el efecto es el mismo que no definirlo (significa que la conexi&oacute;n no es un hinge). Si el valor no es cero esta conexi&oacute;n es como un hinge, y los dos bricks conectados por esta conexi&oacute;n pueden rotar respecto del otro sobre este punto.</P>

<P>El <span class="Important">campo ConnectionTypeList</span> enumera los <span class="Important">campos ConnectionType</span> que describen todos los diferentes tipos de conexiones.</P>

<P>El <span class="Important">campo ConnectionType</span> tambi&eacute;n contiene un olor y tama&ntilde;o de punto para esta conexi&oacute;n. Pero m&aacute;s importante , este campo tiene el atributo obligatorio <span class="Important">name</span> que es el nombre de la conexi&oacute;n, de modo que debe ser un nombre &uacute;nico en la lista de conexiones. Este mismo nombre se debe emplear en los archivos de descripci&oacute;n XML de las piezas que usen este tipo de conexi&oacute;n en el campo <span class="Important">&lt;connexion&gt;&lt;type&gt;</span>.</P>

<P>A continuaci&oacute;n hay una lista de las conexiones que se han creado hasta la fecha. Hist&oacute;ricamente se usaba un n&uacute;mero, pero estos ser&aacute;n renombrados con nombres expl&iacute;citos en la versi&oacute;n 1.8. </P>
<DIV CLASS="TechNote">
<FONT STYLE="background-color:yellow">1 = V&iacute;a (4.5V, 12V or 9V)</font><BR> <FONT STYLE="background-color:cyan">2 = Carretera</font><BR> <FONT STYLE="background-color:purple">3 = Monorail (est&aacute;ndar)</font><BR> <FONT STYLE="background-color:pink">4 = Monorail (curva corta)</font><BR> <FONT STYLE="background-color:lightgreen">5 = V&iacute;a Duplo</font><BR>
</DIV>

</BODY>
</HTML>
