<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alex McKenna">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>Mover piezas</Title>
</HEAD>
<BODY>
<H1>Mover piezas</H1>

<BR>
<CENTER><IMG SRC="MainToolbar.png"></CENTER>

<P>Se pueden <B>mover</B> las piezas una vez que est&aacute;n en el &aacute;rea de dise&ntilde;o. Pulsa sobre la pieza con el bot&oacute;n izquierdo y arr&aacute;stralo a su lugar de destino. Se puede seleccionar el tama&ntilde;o de la cuadr&iacute;cula pulsando la flecha al lado del bot&oacute;n de tama&ntilde;o de cuadr&iacute;cula <span class="RefNumber">10</span> y eligiendo una distancia de separaci&oacute;n en studs de la lista desplegable. La opci&oacute;n de ajuste autom&aacute;tica de la pieza se puede deshabilitar pulsando sobre el bot&oacute;n mismo<BR>
Al <span class="Important">unir un grupo de piezas</span> (por ejemplo una secci&oacute;n de v&iacute;as), se recomienda <span class="Important">hacer click sobre y arrastrar la pieza</span> que servir&aacute; de uni&oacute;n con la otra parte. Si pulas y arrastras sobre cualquier otra parte de tu selecci&oacute;n es posible que intentar&aacute; ajustarse a otra parta de la cuadr&iacute;cula, en vez de a la pieza que deseas.</P>

<P>Se pueden <B>rotar</B> las piezas hacia la izquierda <span class="RefNumber">12</span> y hacia la derecha <span class="RefNumber">13</span>. Dependiendo de lo que deseas rotar tal vez quieras ajustar el &aacute;ngulo de os pasos de rotaci&oacute;n. Esto se puede cambiar usando el bot&oacute;n <span class="RefNumber">11</span>. Un ajuste de 22,5º es perfecto para alinear v&iacute;as curvas, mientras que un &aacute;ngulo de 90º es suficiente para la mayor&iacute;a de otros casos. Una vez conectada a otra pieza, la pieza que deseas rotar siempre quedar&aacute; unida la pieza con la que va conectada. El tama&ntilde;o del paso de rotaci&oacute;n de la pieza ser&aacute; el necesario para hacer que se volver&aacute; a conectar con el siguiente conector disponible en la pieza que se est&aacute; rotando. Para v&iacute;as curvas, rotar una pieza una vez establecida la conexi&oacute;n la har&aacute; girar en el sentido contrario. Por ejemplo, una pieza curva que giraba hacia la derecha ahora ir&aacute; hacia la izquierda. Todas las piezas subsiguientes que a&ntilde;adas haciendo clic sobre ella en la biblioteca de piezas tambi&eacute;n girar&aacute; hacia la izquierda hasta que decidas invertir la direcci&oacute;n de nuevo. Esto se puede hacer de forma sencilla pulsando la barra de espacio una vez conectadas las piezas.</P>

<P>Se pueden <B>alinear </B>piezas haciendo un ajuste autom&aacute;tica de las piezas a la cuadr&iacute;cula o simplemente conect&aacute;ndolas a otra pieza que ya est&aacute; alineada con la cuadr&iacute;cula El tama&ntilde;o de la cuadr&iacute;cula se puede elegir con el bot&oacute;n <span class="RefNumber">10</span>.</P>

<P>Se pueden <B>unir </B>piezas colocando el conector circular, que se ve al seleccionar una pieza individual, sobre el conector de la pieza con la que la quieres conectar. Cada tipo de pieza tiene una categor&iacute;a de conexi&oacute;n de diferente color (v&iacute;as, carretera, duplo etc.). Solo se pueden unir conectores del mismo color. Una conexi&oacute;n correcta se indica por la desaparici&oacute;n de los puntos de conexi&oacute;n al de-seleccionar las piezas. You can hide the connection points through the <span class="path">&nbsp;View &gt; Connection Points&nbsp;</span> menu.<BR>
Se puede rotar entre los diferentes conectores circulares de una pieza pulsando la tecla enter (una v&iacute;a recta tiene 2 conectores, un desv&iacute;a 3 etc.). Si eliges a&ntilde;adir piezas haciendo clic sobre las mismas en el &aacute;rea de piezas, estas se unir´n de manera autom&aacute;tica al conector que hayas seleccionado pulsando el bot&oacute;n enter. Al arrastrar, piezas individuales rotar&aacute;n de manera autom&aacute;tica para conectar en la misma direcci&oacute;n que la pieza a la que est&aacute; siendo conectada (especialmente relevante para v&iacute;as curvas).</P>

<P>Mandar al fondo y traer al frente en una herramienta importante, especialmente se tienes diferentes categor&iacute;as de piezas en la misma capa (por ejemplo baseplates y v&iacute;as), o si quieres hacer hincapi&eacute; en el uso de un puente (por ejemplo, una v&iacute;a pasa encima de otra). Esta funci&oacute;n est&aacute; disponible con los botones <span class="RefNumber">14</span> y <span class="RefNumber">15</span> de la barra de herramientas. Cuanto hacia el fondo o el frente se encuentran las piezas depender&aacute; de cuando se a&ntilde;adieron. Las piezas m&aacute;s antiguas estar&aacute;n hacia el fondo y las m&aacute;s nuevas hacia el frente. Al hacer un clic derecho sobre la pieza seleccionada puede elegir si traerlo .al frente o mandarlo al fondo</P>

<P>Mover, girar, alinear y cambiar la profundidad funicona exactamente igual tanto con piezas como con textos y reglas. Adem&aacute;s, todas  estas acciones se pueden deshacer y rehacer, vea la secci&oacute;n <A HREF="Creating_Modifying_Layouts_Undo_and_Redo.htm">Deshacer y rehacer</A>  para m&aacute;s detalles.</P>

</BODY>
</HTML>
