<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alex McKenna">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>Los cuatro tipos de capas</Title>
</HEAD>
<BODY>
<H1>Los cuatro tipos de capas</H1>
<BR>
<CENTER><IMG SRC="LayerPane.png"></CENTER>

<H2>Capas de cuadr&iacute;cula</H2>
<P>Por defecto, un nuevo trazado siempre comienza con una capa de cuadr&iacute;cula con una cuadr&iacute;cula en blanco <span class="RefNumber">11</span>. Si no quieres que un trazado contenga una capa de cuadr&iacute;cula por defecto, puedes modificar esto en las <A HREF="General_Option.htm">opciones generales</A>. Puedes a&ntilde;adir m&aacute;s capas de cuadr&iacute;cula pulsando <span class="RefNumber">3</span>.  Una capa de cuadr&iacute;cula adicional puede ser pr&aacute;ctica si quieres tener coordenadas verticales y horizontales en capas separadas para poder esconder una u otra.</p>

<p>Estas capas siempre son transparentes y contienen coordenadas de cuadr&iacute;cula. Puedes acceder a las opciones de cuadr&iacute;cula y texto haciendo doble clic sobre la pesta&ntilde;a de la capa de cuadr&iacute;cula <span class="RefNumber">10</span>. Puedes cambiar el color de fondo mediante el men&uacute; <span class="path">&nbsp;editar &gt; fondo de mapa&nbsp;</span>. Vea la secci&oacute;n <A HREF="Appearance_Option.htm">Opciones de apariencia</A> para m&aacute;s detalles.</p>

<p>Ten en cuenta que haciendo clic sobre la cuadr&iacute;cula y arrastr&aacute;ndola, mover&aacute;s las coordenadas iniciales de los ejes X e Y. </P>

<H2>Capas de ladrillos</H2>
<P>Las capas de ladrillos se usan para insertar los elementos  LEGO<sup>&#174;</sup>. Tener varias capas puede facilitar la tarea de editar y organizar un trazado complejo.  En la captura de pantalla de arriba se usaron tres capas de ladrillo diferentes: Una para la mesa <span class="RefNumber">13</span>, una para las carreteras y edificios y otra para las v&iacute;as. Esta opci&oacute;n tambi&eacute;n es pr&aacute;ctica si tienes trazados que combinan diferentes tipos de v&iacute;as. Por ejemplo, puedes usar una capa para 9V, una para 12V y otra para monorail. El contenido de cada capa se puede mover independientemente de las dem&aacute;s capas.</P>
<p>Por defecto, un nuevo dise&ntilde;o tambi&eacute;n tiene inicialmente una capa de piezas que est&aacute; seleccionada al crearlo, por lo que se puede empezar a construir directamente tras arrancar Bluebrick, o al crear un nuevo dise&ntilde;o al seleccionar el men&uacute; <span class="path">&nbsp;Archivo &gt; Nuevo&nbsp;</span> . Pero como en el caso de la cuadr&iacute;cula por defecto, se puede cambiar este comportamiento en las  <a href="Preferences_General.htm">Preferencias generales</a>. Para a&ntilde;adir una nueva capa de piezas, pulsa el bot&oacute;n  <span class="RefNumber">4</span>.</p>

<H2>Capas de &aacute;rea</H2>
<P>Las capas de &aacute;rea se usan para marcar o reservar secciones en y alrededor del dise&ntilde;o que posiblemente no se necesiten para LEGO, o una parte de tu trazado fijo <span class="RefNumber">12</span>. En la captura de pantalla de arriba, el &aacute;rea marcado indica la ubicaci&oacute;n del controlador 9V. Estas secciones se marcan con la herramienta de pintar que est&aacute; activa s&oacute;lo cuando se selecciona una capa de &aacute;rea. Para a&ntilde;adir un nuevo &aacute;rea, pulsa el bot&oacute;n<span class="RefNumber"> 5</span>. Puedes cambiar el color simplemente haciendo clic sobre el bot&oacute;n de la herramienta de pintar <span class="RefNumber">15</span>, o puedes seleccionar el color deseado a trav&eacute;s de <span class="path">&nbsp;editar &gt; herramienta de pintar... &gt; elegir color&nbsp;</span> menu. Haciendo doble clic sobre la pesta&ntilde;a de la capa de &aacute;rea te dar&aacute; acceso a las opciones de transparencia y el tama&ntilde;o del pincel en studs.</P> 
<P>Todo el &aacute;rea se puede mover pulsando la tecla CTRL (por defecto) y arrastr&aacute;ndola a su nueva ubicaci&oacute;n con el rat&oacute;n. Nota que se mover&aacute; todo el contenido de la capa.</P>
<P>Las &aacute;reas pintadas pueden ser borradas haciendo clic sobre flecha al lado de la herramienta de pintar <span class="RefNumber">15</span> y seleccionando la herramienta de borrar.  Desafortunadamente, no hay forma de copiar/pegar o mover s&oacute;lo una parte del &aacute;rea.</P>

<H2>Capas de texto</H2>
<P>La capas de texto son pr&aacute;cticas para marcar secciones del trazado <span class="RefNumber">14</span>. Pulsa <span class="RefNumber">6</span> y luego haz doble clic dentro del &aacute;rea de la capa para abrir una caja de texto. Escribe el texto y modifica las propiedades del texto a voluntad. Pulsa OK para cerrar la ventana y luego coloca el texto en la posici&oacute;n deseada con el rat&oacute;n. El texto tambi&eacute;n se puede rotar, usando los botones para rotar y los ajustes de rotaci&oacute;n. For more details about Text editing, please read the <a href="Creating_Modifying_Layouts_Using_Texts.htm">Using Texts</a> section.</p>
<p>Al igual que con cualquier tipo de capa, tambi&eacute;n se puede modificar la transparencia de una capa de texto haciendo doble clic en la pesta&ntilde;a de la capa <span class="RefNumber">10</span>. As&iacute;, si quieres tener diferentes niveles de transparencia para diferentes textos, podr&aacute;s hacerlo usando varias capas de texto.</p>

<h2>Capas de Reglas</h2>
<p>Las capas de reglas son &uacute;tile spara medir distancias en tu dise&ntilde;o. Puedes a&ntilde;adir una nueva capa de reglas pulsando el bot&oacute;n <span class="RefNumber">7</span>. En una capa de reglas puedes a&ntilde;adir reglas lineales y circulares que pueden mostrar la distancia en varias unidades (Stud, LDU, tramos de recta, m&oacute;dulos, metros y pies). Estas reglas tambi&eacute;n pueden usarse para, s&iacute;mplemente, delimitar los muros de una sala de exposici&oacute;n donde instalar&aacute;s tu dise&ntilde;o. Las reglas tambi&eacute;n se pueden fijar a piezas situadas bajo las mismas, con lo que la regla actualizar&aacute; autom&aacute;ticamente sus dimensiones cuando se mueva la pieza. Para m&aacute;s detalles sobre las capas de reglas, por favor consulta la secci&oacute;n <a href="Creating_Modifying_Layouts_Using_Rulers.htm">Usar Reglas</a>.</p>

</BODY>
</HTML>
