<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta name="keywords" content="BlueBrick, Help">
<meta name="description" content="The reference documentation for BlueBrick.">
<meta name="author" content="Alex McKenna">
<link rel="StyleSheet" href="../BlueBrick.css" type="text/css" media="screen">
<title>Guardar y cargar</title>
</head>
<body>
<h1>Guardar y cargar</h1>

<br>
<center><img src="MainToolbar.png"></center>

<p>BlueBrick es un <span class="Important">programa de documento &uacute;nico</span>, lo que significa que s&oacute;lo puedes abrir un trazado a la vez. De todos modos, es posible lanzar varias instancias de BlueBrick y abrir un documento diferente cada para poder copiar parte de un dise&ntilde;o en otro. No es posible a&uacute;n copiar una capa completa, pero puede que esta limitaci&oacute;n se elimine en una versi&oacute;n futura de BlueBrick.</p>

<p>Para <B>crear</B> un nuevo dise&ntilde;o pulsa el bot&oacute;n 1 &quot;crear nuevo mapa&quot; o haz clic en <span class="path">&nbsp;archivo &gt; nuevo&nbsp;</span>, o pulse CTRL + N.</p>

<p>Para <B>abrir </B>un dise&ntilde;o existente pulse el bot&oacute;n 2 &quot;abrir mapa&quot;, o elige  <span class="path">&nbsp;archivo &gt; abrir...&nbsp;</span>, o pulse CTRL + O.</p>

<p>Para guardar un trazado pulse el bot&oacute;n 3 &quot;guardar mapa actual&quot;, o vaya a <span class="path">&nbsp;archivo &gt; guardar&nbsp;</span> o <span class="path">&nbsp;archivo &gt; guardar como...&nbsp;</span>, o pulsa CTRL + S. Puedes elegir guardarlo en formato .bbm (BlueBrick), .ldr (LDraw), .mpd (LDraw multiple parts file), .ncp (4DBrix) o .tdl (trackdesigner).</p>

<ul>
	<LI><B>BBM:</B> Solo el formato nativo de BlueBrick guarda toda la informaci&oacute;n del mapa como capas, &aacute;reas y textos.</LI>
	<LI><B>LDraw LDR:</B> Guardar en formato LDraw te da la posibilidad de ver el trazado en 3D.<BR> 
	Ten en cuenta que abrir el archivo en LDraw puede implicar perder aquellas piezas de BlueBrick que no est&aacute;n en la biblioteca de piezas LDraw. Aseg&uacute;rate de tener la &uacute;ltima versi&oacute;n de la biblioteca disponible en <A HREF="https://www.ldraw.org">la web de LDraw</A>. Una vez guardado en formato LDR estas piezas no volver&aacute;n si abres el archivo posteriormente en BlueBrick. Ten en cuenta tambi&eacute;n que, con la excepci&oacute;n de las capas de ladrillos, cualquier capa de cuadr&iacute;cula, &aacute;rea o texto adicional hechos en BlueBrick se perder&aacute;n. Lo que fueron capas en BlueBrick se ver&aacute;n en LDraw como pasos de construcci&oacute;n entre cada &quot;capa&quot; al visualizarlo en un editor LDraw. Al abrir un archivo LDR en BlueBrick, las diferentes capas de ladrillos se mostrar&aacute;n, aunque estas habr&aacute;n perdido su nombre. Cualquier cambio que hagas en la altura de las piezas mientras estás en el formato LDraw, se verá como una elevación de ladrillo en BlueBrick. De cualquier modo, los grupos y reglas se graban correctamente en formato LDraw.</LI>
	<LI><B>LDraw MPD:</B> Esto es b&aacute;sicamente lo mismo que el LDraw LDR, con la diferencia que cada capa de BlueBrick se guardar&aacute; como modelo y se guardan los nombres de las capas de ladrillos. Ten en cuenta que toda la informaci&oacute;n de capas, salvo las propias capas de ladrillos, se perder&aacute;.</LI>
	<li><b>4DBrix NCP:</b>Esto asegura la máxima compatibilidad con 4DBrix, pero algunas partes avanzadas de 4DBrix no han sido creadas todavía para BlueBrick en la fecha de lanzamiento de la versión 1.9.0 de BlueBrick. La futura actualización del paquete de la biblioteca de piezas de 4DBrix puede aportar la compatibilidad completa.</li>
	<LI><B>Track Designer:</B> Esto garantiza la m&aacute;xima compatibilidad, aunque algunas opciones como la polaridad y las inclinaciones a&uacute;n no son reconocidas en BlueBrick.</LI>
</ul>

</body>
</html>
