<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alex McKenna">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>A&ntilde;adir y borrar piezas</Title>
</HEAD>
<BODY>
<H1>A&ntilde;adir y borrar piezas</H1>

<BR>
<CENTER><IMG SRC="MainToolbar.png"></CENTER>

<P>Se pueden <B>a&ntilde;adir</B> piezas de 3 maneras diferentes:</P>
<ul>
  <li> Se puede hacer simplemente arrastrando la pieza deseada al panel del trazado (v&eacute;ase la secci&oacute;n <A HREF="Software_Overview_Window_Panes.htm">Paneles de la ventana</A> para m&aacute;s detalles)</li>
  <li>O haciendo un clic izquierdo sobre la pieza en el panel de piezas (la pieza se a&ntilde;adir&aacute; a la derecho de de la selecci&oacute;n activa)</li>
  <li>O usando un atajo de teclado. Por ejemplo &quot;S&quot; insertar&aacute; una recta de 9V a la derecho de la selecci&oacute;n activa. Tambi&eacute;n puedes configurar otros atajos de teclado (v&eacute;ase la secci&oacute;n <A HREF="Preferences_Shortcut_Keys.htm">Atajos de teclado</A> para m&aacute;s detalles).</li>
</ul>

<P>Las funciones <strong>Borrar, Cortar, Copiar y Pegar</strong> est&aacute;n disponibles con las teclas <span class="RefNumber">6</span> al <span class="RefNumber">9</span>, adem&aacute;s de los atajos habituales de otros programas.. Por ejemplo, CTRL + C para Copiar, CTRL + X for Cut, CTRL + V para Pegar y Del or retroceso (&lt;--) para borrar. Tambi&eacute;n puedes pegar piezas duplic&aacute;ndolas (ver m&aacute;s abajo). Tambi&eacute;n se pueden cortar o copiar piezas de una capa a otra.</P>

<p>Por defecto, si pegas piezas en la misma capa, se a&ntilde;adir&aacute; un desplazamiento a las piezas pegadas respecto a la posici&oacute;n original de las piezas copiadas, pero si se pegan en una capa distinta, se pegar&aacute;n en la misma posici&oacute;n exacta. Este comportamiento, as&iacute; como el desplazamiento al pegar se puede ajustar en las  <a href="Preferences_Edition.htm">Preferencias de edici&oacute;n</a>.</p>

<p>Puedes copiar/pegar las piezas en m&uacute;ltiples instancias del programa BlueBrick. Esto es &uacute;til si quieres copiar una parte de un dise&ntilde;o de un fichero BBM a otro. Para hacerlo, simplemente lanza dos instancias de BlueBrick y abre un fichero distinto en cada una. Copia las piezas que quieras de una instancia y entonces cambia a la otra y p&eacute;galas.</p>
<p>se pueden <B>Duplicar</B> piezas seleccionando una pieza o texto sin soltar el bot&oacute;n izquierdo, luego mantener pulsado ALT, mover el rat&oacute;n a la ubicaci&oacute;n deseada del duplicado y solt&aacute;ndolo. Al activarse, la funci&oacute;n de duplicado se indica con un peque&ntilde;o &quot;+&quot; al lado del cursor cuando se mantiene pulsada la tecla ALT (por defecto), y el cursor est&aacute; encima de la pieza seleccionada.</p>

<P>Borrar, cortar, copiar, pegar y duplicar funcionan del mismo modo con piezas, textos y reglas. Adem&aacute;s, todas estas  acciones se pueden deshacer y rehacer, vea la secci&oacute;n <A HREF="Creating_Modifying_Layouts_Undo_and_Redo.htm">Deshacer y rehacer</A>  para m&aacute;s detalles.</P>

</BODY>
</HTML>
