<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alex McKenna">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>Los cuatro tipos de capas</Title>
</HEAD>
<BODY>
<H1>Los cuatro tipos de capas</H1>
<BR>
<CENTER><IMG SRC="LayerPane.png"></CENTER>

<H2>Capas de texto</H2>
<P>La capas de texto son pr&aacute;cticas para marcar secciones del trazado <FONT CLASS="RefNumber">14</FONT>. Pulsa <FONT CLASS="RefNumber">6</FONT> y luego haz doble clic dentro del &aacute;rea de la capa para abrir una caja de texto. Escribe el texto y modifica las propiedades del texto a voluntad. Pulsa OK para cerrar la ventana y luego coloca el texto en la posici&oacute;n deseada con el rat&oacute;n. Para cambiar las propiedades del texto, haz doble clic sobre la pesta&ntilde;a de la capa de texto <FONT CLASS="RefNumber">10</FONT>. El texto tambi&eacute;n se puede rotar, usando los botones para rotar y los ajustes de rotaci&oacute;n.</P>

<H2>Capas de cuadr&iacute;cula</H2>
<P>Por defecto, un nuevo trazado siempre comienza con una capa de cuadr&iacute;cula con una cuadr&iacute;cula blanca <FONT CLASS="RefNumber">11</FONT>. Puedes a&ntilde;adir m&aacute;s capas de cuadr&iacute;cula pulsando <FONT CLASS="RefNumber">3</FONT>. Estas capas siempre son transparentes y contienen coordenadas de cuadr&iacute;cula. Puedes acceder las opciones de cuadr&iacute;cula y texto haciendo doble clic sobre la pesta&ntilde;a de la capa de cuadr&iacute;cula <FONT CLASS="RefNumber">10</FONT>. Puedes cambiar el color de fondo mediante el men&uacute; <FONT CLASS="path">&nbsp;editar &gt; fondo de mapa&nbsp;</FONT>. Vea la secci&oacute;n <A HREF="Appearance_Option.htm">Opciones de apariencia</A> para m&aacute;s detalles. Si no quieres que un trazado contenga una capa de cuadr&iacute;cula por defecto, puedes modificar esto en las <A HREF="General_Option.htm">opciones generales</A>. Una capa de cuadr&iacute;cula adicional puede ser pr&aacute;ctica si quieres tener coordenadas verticales y horizontales en capas separadas para poder esconder una u otra. Nota que haciendo clic sobre la cuadr&iacute;cula y arrastr&aacute;ndola, mover&aacute;s las coordenadas iniciales de los ejes X e Y. </P>

<H2>Capas de &aacute;rea</H2>
<P>Las capas de &aacute;rea se usan para marcar o reservar secciones en y alrededor del trazado que posiblemente no se necesiten para LEGO, o una parte de tu trazado fijo <FONT CLASS="RefNumber">12</FONT>. Estas secciones se marcan con la herramienta de pintar. Puedes cambiar el color simplemente haciendo clic sobre el bot&oacute;n de la herramienta de pintar <FONT CLASS="RefNumber">15</FONT>, o puedes seleccionar el color deseado a trav&eacute;s de <FONT CLASS="path">&nbsp;editar &gt; herramienta de pintar... &gt; elegir color&nbsp;</FONT> menu. Haciendo doble clic sobre la pesta&ntilde;a de la capa de &aacute;rea te dar&aacute; acceso a las opciones de transparencia y el tama&ntilde;o del pincel en studs. En el pantallazo arriba, el &aacute;rea marcado indica la ubicaci&oacute;n del controlador 9V.</P> 
<P>Todo el &aacute;rea se puede mover pulsando la tecla CTRL (por defecto) y arrastr&aacute;ndola a su nueva ubicaci&oacute;n con el rat&oacute;n. Nota que se mover&aacute; todo el contenido de la capa.</P>
<P>Las &aacute;reas pintadas pueden ser borradas haciendo clic sobre flecha al lado de la herramienta de pintar <FONT CLASS="RefNumber">15</FONT> y seleccionando la herramienta de borrar. 
</P>

<H2>Capas de ladrillos</H2>
<P>Las capas de ladrillos se usan para insertar los elementos de LEGO. Tener varias capas puede facilitar la tarea de editar y organizar un trazado complejo  En el pantallazo de arriba se usaron tres capas de ladrillo diferentes. Una para la mesa <FONT CLASS="RefNumber">13</FONT>, una para las carreteras y edificios y otra para las v&iacute;as. Esta opci&oacute;n tambi&eacute;n es pr&aacute;ctica si tienes trazados que combinan diferentes tipos de v&iacute;as. Por ejemplo, puedes usar una capa para 9V, una para 12V y otra para monorail. El contenido de cada capa se puede mover independientemente de las dem&aacute;s capas.</P>

</BODY>
</HTML>
