<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta name="keywords" content="BlueBrick, Help">
<meta name="description" content="The reference documentation for BlueBrick.">
<meta name="author" content="Alex McKenna">
<link rel="StyleSheet" href="../BlueBrick.css" type="text/css" media="screen">
<title>Exportar un trazado como imagen</title>
</head>
<body>
<h1>Exportar un trazado como imagen</h1>

<p>Exportar un trazado como imagen puede ser pr&aacute;ctico cuando no quieres o nopuedes imprimir el trazado y necesitas mostrarlo usando un dispositivo que no tiene instalado Bluebrick o no lo puede ejecutar.  Tambi&eacute;n es pr&aacute;ctico si quieres a&ntilde;adirlo a un archivo con fotograf&iacute;a (por ejemplo en internet). Esta funci&oacute;n se encuentra bajo el men&uacute; <span class="path">&nbsp;archivo &gt; exportar imagen...&nbsp;</span> o, simplemente, pulsando CTRL+E</p>

<center><img src="Export_Report_Printing_Export_Layout_as_Image.png"></center>

<H2>Opciones de exportación</H2>

<p>La marca de agua se exportar&aacute; por defecto en la parte inferior derecha del marco rojo, excepto si se deselecciona la casilla  <span class="RefNumber">1</span>. El circuito el&eacute;ctrio y los puntos de conexi&oacute;n tambi&eacute;n pueden ser exportados seleccionando las casillas <span class="RefNumber">2</span> y <span class="RefNumber">3</span>.</p>

<p>La ventana de opciones te permite seleccionar la secci&oacute;n del trazado que quieres exportar. Simplemente haz clic y arrastra el rat&oacute;n sobre la imagen para colocar un marco rojo alrededor del &aacute;rea que quieres exportar. Puedes hacer una selecci&oacute;n m&aacute;s precisa usando las cajas Tama&ntilde;o del "&Aacute;rea en studs" <span class="RefNumber">4</span>.</p>

<h2>Tamaño de la imagen y el recuento</h2>

<p>Una vez que haya seleccionado el área de su diseño que desea exportar, debe especificar el tamaño y el número de imágenes a las que debe exportarse su diseño. Los campos <span class="RefNumber">5</span> le permiten especificar en cuántas filas y columnas debe dividirse la exportación. Por ejemplo, si se especifican 3 en ancho y 2 en alto, entonces se exportarán 6 imágenes. Dividir la exportación en varias imágenes puede ser útil si tiene un diseño muy grande y aún así quiere mantener una resolución de imagen razonable.</p>

<p>Entonces puede especificar el tamaño de la(s) imagen(es) exportada(s) en pixel <span class="RefNumber">6</span> o la resolución de la(s) imagen(es) <span class="RefNumber">7</span>, es decir, cuantos pixels se usan para dibujar un stud (saviendo que la resoluci&oacute;n nativa de BlueBrick son 8 pixels/stud, por lo que aunque indiques m&aacute;s, no tendr&aacute;s m&aacute;s detalle en la imagen exportada) o bien el tama&ntilde;o de la imagen exportada. Ten en cuenta que cada vez que escribas uno de los tres valores, los otros dos ser&aacute;n recalculados autom&aacute;ticamente, dado que est&aacute;n enlazados. Por ejemplo, a mayor sea la relaci&oacute;n pixel/stud, mayor ser&aacute; el tama&ntilde;o de la imagen, o, si especificas un tama&ntilde;o fijo, Bluebrick recalcular&aacute; la resoluci&oacute;n necesaria para encajar el dise&ntilde;o en ese tama&ntilde;o. El tamaño y la resolución de la imagen serán los mismos para todas las imágenes exportadas si se establece más de una fila o columna.</p>

<p>Los tipos de archivo soportados son .bmp, .jpg, .gif y .png, y el tamaño máximo de imagen permitido por BlueBrick es de 4096 x 4096 píxeles. Si desea crear una imagen más grande de su diseño, aumente el número de filas o columnas para exportar en varias imágenes, a continuación, volver a montar en su software de edición de imágenes favorito.</p>

<h2>Imprimir</h2>

<p>Se puede imprimir el trazado imprimiendo la imagen que guardaste mediante la herramienta <span class="path">&nbsp;archivo &gt; exportar imagen...&nbsp;</span>. Puedes abrir la imagen con el programa est&aacute;ndar que viene con tu sistema operativo e imprimirlo desde all&iacute;.</p>

</body>
</html>
