<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alex McKenna">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>Exportar un trazado como imagen</Title>
</HEAD>
<BODY>
<H1>Exportar un trazado como imagen</H1>
<BR>
<CENTER><IMG SRC="Export_Report_Printing_Export_Layout_as_Image.png"></CENTER>

<H2>Opciones de visualizaci&oacute;n</H2>

<p>La marca de agua se exportar&aacute; por defecto en la parte inferior derecha del marco rojo, excepto si se deselecciona la casilla  <font class="RefNumber">1</font>. El circuito el&eacute;ctrio y los puntos de conexi&oacute;n tambi&eacute;n pueden ser exportados seleccionando las casillas <font class="RefNumber">3</font> y <font class="RefNumber">4</font>.</p>

<p>La casilla  <font class="RefNumber">2</font> te permite exportar el contorno de las piezas, que puede ser pr&aacute;ctico si se quiere ver con claridad las baseplates y los tramos de v&iacute;a para contarlos y colocarlos en tu dise&ntilde;o r&aacute;pidamente el d&iacute;a del montaje de la exposici&oacute;n.</p>

<H2>Exportar</H2>

<P>Exportar un trazado como imagen puede ser pr&aacute;ctico cuando no quieres o nopuedes imprimir el trazado y necesitas mostrarlo usando un dispositivo que no tiene instalado Bluebrick o no lo puede ejecutar.  Tambi&eacute;n es pr&aacute;ctico si quieres a&ntilde;adirlo a un archivo con fotograf&iacute;a (por ejemplo en internet). Esta funci&oacute;n se encuentra bajo el men&uacute;<FONT CLASS="path">&nbsp;archivo &gt; exportar imagen...&nbsp;</FONT> o, simplemente, pulsando CTRL+E
<P>La ventana de opciones te permite seleccionar la secci&oacute;n del trazado que quieres exportar. Simplemente haz clic y arrastra el rat&oacute;n sobre la imagen para colocar un marco rojo alrededor del &aacute;rea que quieres exportar. Puedes hacer una selecci&oacute;n m&aacute;s precisa usando las cajas &quot;Tama&ntilde;o del &aacute;rea en studs&quot; <font class="RefNumber">5</font>.</P>

<P>Tambi&eacute;n puedes introducir las dimensiones de la imagen resultante. Esto te permite controlar el nivel de detalle que quieres en la imagen exportada. En la secci&oacute;n &quot;Tama&ntilde;o de la imagen en studs&quot; <font class="RefNumber">6</font> section, puedes inesertar bien la resoluci&oacute;n, es decir, cuantos pixels se usan para dibujar un stud (saviendo que la resoluci&oacute;n nativa de BlueBrick son 8 pixels/stud, por lo que aunque indiques m&aacute;s, no tendr&aacute;s m&aacute;s detalle en la imagen exportada) o bien el tama&ntilde;o de la imagen exportada. Ten en cuenta que cada vez que escribas uno de los tres valores, los otros dos ser&aacute;n recalculados autom&aacute;ticamente, dado que est&aacute;n enlazados. Por ejemplo, a mayor sea la relaci&oacute;n pixel/stud, mayor ser&aacute; el tama&ntilde;o de la imagen, o, si especificas un tama&ntilde;o fijo, Bluebrick recalcular&aacute; la resoluci&oacute;n necesaria para encajar el dise&ntilde;o en ese tama&ntilde;o.</P>

<P>Los tipos de archivos a los que puede exportar son .BMP, .GIF, .JPG y .PNG y el tama&ntilde;o m&aacute;ximo para exportar que permite BlueBrick es de 4096x4096 pixels. En la actualidad, Bluebrick no permite exportar en un &uacute;nico paso autom&aacute;tico dise&ntilde;os muy grandes usando m&uacute;ltiples im&aacute;genes con una resoluci&oacute;n fija.  Si se quiere exportar algo de un tama&ntilde;o mayor a 4096 pixels de ancho o alto, se pude hacer manualmente exportando m&uacute;ltiples veces cada vez una parte, seleccionando cada secci&oacute;n con el marco rojo, para despu&eacute;s ensamblar todas las secciones exportadas como images usando tu programa favorito de edici&oacute;n de im&aacute;genes. </P>

<H2>Imprimir</H2>

<P>Se puede imprimir el trazado imprimiendo la imagen que guardaste mediante la herramienta &quot;Guardar imagen...&quot;. Puedes abrir la imagen con el programa est&aacute;ndar que viene con tu sistema operativo e imprimirlo desde all&iacute;.</P>

</BODY>
</HTML>
