<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alex McKenna">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>Preferencias generales</Title>
</HEAD>
<BODY>
<H1>Preferencias generales</H1>
<BR>
<CENTER><IMG SRC="General_Preferences.png"></CENTER>

<P>El <B>idioma del programa</B> se puede cambiar arriba a la izquierda. El cambio afectar&aacute; casi todo el texto del programa. Deber&aacute;s reiniciar BlueBrick para que los cambios tengan efecto.  Los elementos que no e ver&aacute;n afectados por el cambio son las pesta&ntilde;as encima del &aacute;rea de piezas y ventanas que est&aacute;n relacionadas directamente con el idioma de tu sistema operativo (por ejemplo la paleta de selecci&oacute;n colores).</P>

<P>Preparar tu <B>Configuraci&oacute;n por defecto</B> para nuevos trazados puede ahorrar tiempo m&aacute;s adelante. Por defecto se a&ntilde;aden una capa de cuadr&iacute;cula y una de ladrillos. Para cambiar la informaci&oacute;n de Autor, LUG/LTC y Evento en un mapa existente ve a<FONT CLASS="path">&nbsp;ver &gt; informaci&oacute;n general...&nbsp;</FONT>.</P>

<P>La lista de <B>archivos recientes</B> tiene por defecto 4 entradas. El m&aacute;ximo son 20. Puedes borrar la lista usando el bot&oacute;n &quot;Borrar lista de archivos recientes&quot;. Esta acci&oacute;n no se puede deshacer.</P>

<P>La lista de deshacer/rehacer se puede ajustar. El n&uacute;mero m&aacute;ximo de acciones a deshacer es de 1000. El n&uacute;mero m&aacute;ximo de acciones mostradas es de 50. Nota que cuanto mayor sea el n&uacute;mero de acciones a deshacer que se graban, m&aacute;s memoria ocupar&aacute; el programa.</P>

<P>Los ajustes de rendimiento pueden ser importantes para ordenadores m&aacute;s viejos. Por defecto est&aacute; seleccionada la opci&oacute;n &quot;Equilibrado&quot;. Puedes seleccionar la opci&oacute;n &quot;Menos memoria&quot; si notas que el sistema se hace inestable durante su uso. La mayor&iacute;a de ordenadores deber&iacute;an poder usar los modos &quot;equilibrado&quot; o m&aacute;s r&aacute;pido&quot;</P>

</BODY>
</HTML>
