<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alban Nanty">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>Describir la conectividad preferida dentro del grupo (dificultad media)</Title>
</HEAD>
<BODY>
<H1>Describir la conectividad preferida dentro del grupo (dificultad media)</H1>

<TABLE CLASS="XMLDescription">
<TR>
	<TD CLASS="Tilte">Sintaxis:</TD>
	<TD CLASS="XMLCode">&lt;GroupConnectionPreferenceList&gt;<br> &nbsp;&nbsp;&nbsp;&nbsp;&lt;nextIndex from=&quot;...&quot;&gt;...&lt;/nextIndex&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;...<br> &lt;/GroupConnectionPreferenceList&gt;</TD>
</TR><TR>
	<TD CLASS="Tilte">Valor por defecto:</TD>
	<TD>Si esta etiqueta falta, al conectar un grupo, el siguiente punto de conexi&oacute;n que se activa ser&aacute; el siguiente en la lista de ciclo.</TD>
</TR><TR>
	<TD CLASS="Tilte">Descripci&oacute;n:</TD>
	<TD>Una lista de pares de conexi&oacute;n.</TD>
</TR>  
</TABLE>

<P>EL <FONT CLASS="Important">campo GroupConnectionPreferenceList</FONT> se puede usar para controlar cual ser&aacute; el siguiente punto de conexi&oacute;n que se seleccionar&aacute; despu&eacute;s de establecer una conexi&oacute;n. Este campo contiene una lista de <FONT CLASS="Important">campos nextIndex</FONT>, donde cada entrada indica el siguiente punto de conexi&oacute;n que se seleccionar&aacute; al conectarse el punto especificado.</P>

<P>Este campo es similar al <FONT CLASS="Important">campo nextConnexionPreference</FONT> de una sola pieza (vea la p&aacute;gina <a href="Part_XML_Description_Connection.htm">Describir puntos de conexi&oacute;n</a> para m&aacute;s detalles) pero act&uacute;a sobre todo el grupo. De hecho, si consideras un grupo de do v&iacute;as rectas conectadas entre s&iacute;, al conectar este grupo a otra pieza por el extremo izquierdo de la primera v&iacute;a, querr&aacute;s que el extremo derecho de la otra v&iacute;a se seleccione, no la derecha de la primera v&iacute;a (que ya est&aacute; conectada con la segunda v&iacute;a). Es por eso que necesitamos una descripci&oacute;n de la secuencia de conexi&oacute;n preferida a nivel de grupo.</P>

<div class="TechNote">
<center><img src="../ConnectionPointForGroup.png"></center><br> <br> Los n&uacute;meros rojos son el &iacute;ndice de conexiones de la primera pieza, los n&uacute;meros naranja los de la segunda, y los blancos los que han de usarse para el grupo.
</div>

<p>El <FONT CLASS="Important">campo nextIndex</FONT> contiene dos &iacute;ndices. El primer &iacute;ndice se especifica en el <FONT CLASS="Important">atributo from</FONT> y el segundo <FONT CLASS="Important">dentro del campo</FONT>. Cuando se conecta el punto indicado como &quot;from&quot;, el punto de conexi&oacute;n especificado en el campo ser&aacute; seleccionado. El &iacute;ndice se cuenta de forma secuencial, desde la primera pieza que aparece en el grupo hasta la &uacute;ltima (respetando el orden de las conexiones de cada pieza). Si el grupo contiene otro grupo, entra dentro de ese grupo primero para contar el &iacute;ndice antes de seguir con el grupo actual. En otras palabras, el &aacute;rbol jer&aacute;rquico se explora en profundidad.</p>

<div class="TechNote">
En el ejemplo de grupo de arriba, al conectar la conexi&oacute;n 0, quieres que se seleccione la conexi&oacute;n 3 y viceversa. Por tanto tendr&aacute;s que escribir las siguientes dos l&iacute;neas:<br> <br> &lt;GroupConnectionPreferenceList&gt;<br> &nbsp;&nbsp;&nbsp;&nbsp;&lt;nextIndex from=&quot;0&quot;&gt;3&lt;/nextIndex&gt;<br> &nbsp;&nbsp;&nbsp;&nbsp;&lt;nextIndex from=&quot;3&quot;&gt;0&lt;/nextIndex&gt;<br> &lt;/GroupConnectionPreferenceList&gt;
</div>

</BODY>
</HTML>
