<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alex McKenna">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>Seleccionar piezas</Title>
</HEAD>
<BODY>
<H1>Seleccionar piezas</H1>

<h2>Selecci&oacute;n general </h2>
<P>La selecci&oacute;n general funciona del mismo modo en las capas de ladrillos y en las de texto. Puedes seleccionar piezas individuales haciendo clic sobre ellas, o m&uacute;ltiples piezas arrastrando el puntero sobre las piezas que deseas (creando un rect&aacute;ngulo de selecci&oacute;n). La forma de destacar las piezas seleccionadas se puede modificar en la pesta&ntilde;a &quot;Apariencia&quot; en <A HREF="Appearance_Options.htm">Opciones globales</A>.</P>

<P>Se pueden seleccionar m&uacute;ltiples piezas <span class="Important">manteniendo pulsada la tecla CTRL</span> (por defecto), mientras se va haciendo clic sobre las piezas con el bot&oacute;n izquierdo del rat&oacute;n. Para deseleccionar una pieza, hay que mantener pulsada la tecla CTRL y hacer clic sobre ella.</P>

<P>Tambi&eacute;n se puede seleccionar un grupo de piezas pulsando el bot&oacute;n izquierdo del rat&oacute;n y arrastr&aacute;ndolo para que las piezas deseadas queden dentro del rect&aacute;ngulo de selecci&oacute;n. Puedes hacer m&uacute;ltiples selecciones de grupos mientras si se mantiene pulsada la tecla CTRL (por defecto) al crear rect&aacute;ngulos de selecci&oacute;n adicionales. Si no se mantiene pulsada la tecla CTRL el rect&aacute;ngulo de selecci&oacute;n anterior desaparecer&aacute;.  Si dos rect&aacute;ngulos de selecci&oacute;n que no contienen las mismas piezas se solapan, todas las piezas se unir&aacute;n en un &uacute;nico rect&aacute;ngulo de selecci&oacute;n. Si se arrastra un rect&aacute;ngulo de selecci&oacute;n sobre piezas que ya est&aacute;n seleccionadas las deseleccionar&aacute;.</P>
</BODY>
</HTML>
