<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alban Nanty">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>A&ntilde;adir informaci&oacute;n para compatibilidad con LDraw</Title>
</HEAD>
<BODY>
<H1>A&ntilde;adir informaci&oacute;n para compatibilidad con LDraw</H1>

<TABLE CLASS="XMLDescription">
<TR>
	<TD CLASS="Tilte">Sintaxis:</TD>
	<TD CLASS="XMLCode">&lt;LDraw&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;Alias&gt;...&lt;/Alias&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;Angle&gt;...&lt;/Angle&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;Translation&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;x&gt;...&lt;/x&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;y&gt;...&lt;/y&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;/Translation&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;PreferredHeight&gt;...&lt;/PreferredHeight&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;SleeperID&gt;...&lt;/SleeperID&gt;<BR> &lt;/LDraw&gt;<BR> <BR> <BR> <I>Nota: La etiqueta &lt;Alias&gt; puede tener un atributo opcional llamado &quot;noremap&quot;:</I><BR> &lt;Alias noremap=&quot;true&quot;&gt;...&lt;/Alias&gt;<BR>
	</TD>
</TR><TR>
	<TD CLASS="Tilte">Valor por defecto:</TD>
	<TD>Si no hay etiqueta &lt;LDraw&gt;, la pieza no es compatible con LDraw.</TD>
</TR><TR>
	<TD CLASS="Tilte">Descripci&oacute;n:</TD>
	<TD>Un conjunto de informaci&oacute;n usado por BlueBrick para convertir a piezas  de LDraw a BlueBrick y viceversa.</TD>
</TR>  
</TABLE>

<P>BlueBrick puede guardar y cargar archivos en formato LDraw. Como el origen (ej. de giro) de la pieza en los archivo LDraw no siempre es el mismo que el origen en la biblioteca de BlueBrick, BlueBrick tiene que aplicar alg&uacute;n tipo de transformaci&oacute;n en la posici&oacute;n y orientaci&oacute;n de la pieza al guardar  o cargar un archivo en formato LDraw.</P>

<P>Si ampl&iacute;as tu biblioteca con sets , probablemente no tengas que modificar el archivo porque la biblioteca de LDraw contiene principalmente piezas y muy pocos sets. Debido a esto, tu programa d LDraw no podr&aacute; cargar tus sets a menos que tengas el archivo LDraw correspondiente.</P>

<P>Adem&aacute;s, si ampl&iacute;as tu biblioteca con una pieza, solo tienes que a&ntilde;adir el campo LDraw en el archivo XML si el origen de la pieza es distinto en BlueBrick que en LDraw.</P>

<P>El <FONT CLASS="Important">campo Alias</FONT> contiene una ID de pieza de BlueBrick (el n&uacute;mero de la pieza seguida de un punto y la ID del color) que deber&iacute;a usarse al guardar/cargar en formato LDraw para reemplazar la pieza actual por otra. Este campo es &uacute;til si la pieza no existe a&uacute;n en la biblioteca LDraw, pero se podr&iacute;a usar una similar en su lugar.</P>
<P>Normalmente el <FONT CLASS="Important">campo Alias</FONT> no sirve porque la ID de la pieza en BlueBrick es la misma que en LDraw (por defecto al crear una pieza BlueBrick). Este campo, sin embargo, se puede usar si la ID de BlueBrick es diferente de la de LDraw. Si a&ntilde;ades este campo, BlueBrick emplear&aacute; la ID especificada al guardar en formato LDraw y crear&aacute; adem&aacute;s un enlace de redireccionamiento que se usar&aacute; al cargar un archivo LDraw, a menos que a&ntilde;ades el atributo <FONT CLASS="Important">noremap=&quot;true&quot;</FONT>. Si a&ntilde;ades el atributo <FONT CLASS="Important">noremap=&quot;true&quot;</FONT> y guardas el trazado en formato LDraw, aparecer&aacute; una cruz roja  (pieza desconocida) al cargar el trazado de nuevo en BlueBrick. En la mayor&iacute;a de casos no deber&iacute;as usar el atributo <FONT CLASS="Important">noremap=&quot;true&quot;</FONT>.</P>

<P>El <FONT CLASS="Important">campo Angle</FONT> contiene la diferencia en &aacute;ngulo entre dos sistemas de coordenadas a lo largo del eje UP (en grados).</P>

<P>Los <FONT CLASS="Important">x e y dentro de los campos de traslaci&oacute;n</FONT> contienen la diferencia en posici&oacute;n entre dos sistemas de coordenadas (en <A HREF="http://www.brickwiki.org/wiki/LDU">LDU</A>).</P>

<P>Cuando guardas un trazado BlueBrick en LDraw, BlueBrick coloca todas las piezas en un altura de 0 por defecto. El <FONT CLASS="Important">campo PreferredHeight</FONT> contiene un valo de altura (en <A HREF="http://www.brickwiki.org/wiki/LDU">LDU</A>), que BlueBrick emplea en vez de la altura por defecto. Si modificas la altura de una pieza con un programa para LDraw  y recarga el mapa en BlueBrick, la altura se retendr&aacute; cuando se vuelva a guardar el archivo. El <FONT CLASS="Important">campo PreferredHeight</FONT> solamente se usa en el formato LDraw si la altitud de la pieza es 0.</P>
<P>Nota que i usas un valor que no es cero para el <FONT CLASS="Important">campo PreferredHeight</FONT> de una pieza y guardas un mapa en BlueBrick que la contiene, la altura de esa pieza no volver&aacute; a modificarse en ese mapa BlueBrick. Ni siquiera se cambias el <FONT CLASS="Important">campo PreferredHeight</FONT> de nuevo y recargas la biblioteca de piezas. Esto es as&iacute; porque la pieza se guard&oacute; en un archivo LDR con el primer valor y ese valor es respetado por BlueBrick. De modo que si creas una nueva pieza y quieres ajustar su altura preferida, tienes que recrear el trazado cada vez antes de guardarlo en formato LDraw.</P>

<P>El <FONT CLASS="Important">campo SleeperID</FONT> contiene la ID BlueBrick de una pieza (el n&uacute;mero de la pieza seguido de un punto y la ID del color), del 'sleeper' que hay que usar con la v&iacute;a que estas describiendo. Para una edici&oacute;n r&aacute;pida y c&oacute;moda en BlueBrick, no hace falta a&ntilde;adir los &quot;sleeper&quot;; ya est&aacute;n integrados dentro de los diferentes tipos de v&iacute;as. Pero cuando quieres guardar un trazado en formato LDraw, BlueBrick tiene que generar los &quot;sleeper&quot; en las posiciones correctas. Por eso BlueBrick necesita la informaci&oacute;n LDraw de estas piezas. Para este fin puedes a&ntilde;adir un archivo XML sin GIF asociado, para los &quot;sleepers de la biblioteca de piezas; BlueBrick emplear&aacute; esta informaci&oacute;n al guardar pero ignorar&aacute; estas piezas al cargar un archivo LDraw.</P>
<P>Ya que los &quot;sleepers de vias 4,5V y 12V son compartidos entre partes tramos de via, BlueBrick no intenta adivinar y siempre a&ntilde;ade un &quot;sleeper&quot; a todos los puntos de conexi&oacute;n. <div class="ToTranslate">Fortunately the LDraw parts Authors gently created the needed LDraw shortcut part with just the two rails and the middle sleeper (if needed), and this is the LDraw shortcut part that is used by BlueBrick to export in LDraw format.</div></P>

</BODY>
</HTML>
