<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alban Nanty">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>Describir el per&iacute;metro</Title>
</HEAD>
<BODY>
<h1>Definici&oacute;n del contorno</h1>
<TABLE CLASS="XMLDescription">
<TR>
	<TD CLASS="Tilte">Sintaxis:</TD>
	<TD CLASS="XMLCode">&lt;hull&gt;<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;&lt;point&gt;<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;x&gt;...&lt;/x&gt;<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;y&gt;...&lt;/y&gt;<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;&lt;/point&gt;<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;...<BR>
		&lt;/hull&gt;	
	</TD>
</TR><TR>
	<TD CLASS="Tilte">Valor por defecto:</TD>
	<TD>Las 4 esquinas de una imagen definen su contorno por defecto.</TD>
</TR><TR>
	<TD CLASS="Tilte">Descripci&oacute;n:</TD>
	<TD>El contorno es un envoltorio que contiene toda la pieza. Se define como una lista de puntos, cuyas <font class="Important">coordenadas est&aacute;n en p&iacute;xeles</font>, relativos a la esquina superior izquierda de imagen de la pieza.</TD>
</TR>
</TABLE>

  <P>Una buena descripci&oacute;n del contorno es de utilidad en las piezas que no son ni cuadradas ni rectangulares, como los cambios de v&iacute;a y las curvas. BlueBrick emplea ese contorno para calcular la envolvente de la pieza. La envolvente es el rect&aacute;ngulo m&aacute;s peque&ntilde;o posible (alineado con los ejes vertical y horizontal) que puede contener la pieza entera. Un  contorno bien definido mejora el uso de la pieza. La definici&oacute;n del contorno tambi&eacute;n influye en la cantidad de memoria empleada por BlueBrick. Esto es as&iacute; porque el tama&ntilde;o del contorno influye en el tama&ntilde;o de la imagen necesario al girar la pieza. Por norma general, un contorno convexo es suficiente, pero puedes querer definir un contorno c&oacute;ncavo para mejorar la precisi&oacute;n en la selecci&oacute;n de las piezas. Como norma general, a&ntilde;ade el m&iacute;nimo n&uacute;mero de puntos necesario, ya que esto influye en el rendimiento del programa.</P>
<P>Ten cuidado ya que, a diferencia de los par&aacute;metros anteriores, el contorno se define en p&iacute;xeles, no en studs. La raz&oacute;n para ello es que es mucho m&aacute;s sencillo definir el contorno en p&iacute;xeles, que se pueden encontrar con un editor de imagen, moviendo el cursor sobre la imagen.</P>


<P>En realidad, Bluebrick divide internamente la medida que est&aacute; definida en el fichero XML a la mitad (medio pixel) para ajustar la coordenada en el centro del pixel. Pese a ello, debes utilizar valores decimales para definir las coordenadas en p&iacute;xeles. Est&aacute; permitido utilizar coordenadas de puntos que se encuentren fuera del &aacute;rea de imagen (p.ej. valores negativos o mayores que el tama&ntilde;o de la imagen).</P>
<P>Una  definici&oacute;n de contorno incorrecta puede derivar en una pieza que aparezca recortada al girarla con un &aacute;ngulo libre. Cuando especifiques el contorno de tu pieza, un buen modo de verificarlo es mostrar el contorno usando el men&uacute; <font class="Path">&nbsp;Ver &gt;Contornos &gt; Ladrillos</font>. Aqu&iacute; tienes dos ejemplos, uno de la definici&oacute;n del contorno de un cambio de v&iacute;as, que es un contorno c&oacute;ncavo preciso, que permite hacer clic alrededor de la palanca amarilla sin seleccionarla, y uno de v&iacute;a curva 9V que es un contorno convexo sufici&eacute;ntemente bueno pese a no ser tan preciso.
<P>
  <CENTER><IMG SRC="../HullSwitchPoint.png">&nbsp;&nbsp;&nbsp;&nbsp;<IMG SRC="../HullCurve.png"></CENTER>
  <BR>
  
<DIV CLASS="TechNote">
<PRE><B>Este es el XML correspondiente para el contorno de las curva 9V:</B>

&lt;hull&gt;
    &lt;point&gt;
        &lt;x&gt;0&lt;/x&gt;
        &lt;y&gt;0&lt;/y&gt;
    &lt;/point&gt;
    &lt;point&gt;
        &lt;x&gt;74&lt;/x&gt;
        &lt;y&gt;5&lt;/y&gt;
    &lt;/point&gt;
    &lt;point&gt;
        &lt;x&gt;138&lt;/x&gt;
        &lt;y&gt;26&lt;/y&gt;
    &lt;/point&gt;
    &lt;point&gt;
        &lt;x&gt;138&lt;/x&gt;
        &lt;y&gt;38&lt;/y&gt;
    &lt;/point&gt;
    &lt;point&gt;
        &lt;x&gt;121&lt;/x&gt;
        &lt;y&gt;77&lt;/y&gt;
    &lt;/point&gt;
    &lt;point&gt;
        &lt;x&gt;114&lt;/x&gt;
        &lt;y&gt;85&lt;/y&gt;
    &lt;/point&gt;
    &lt;point&gt;
        &lt;x&gt;0&lt;/x&gt;
        &lt;y&gt;64&lt;/y&gt;
    &lt;/point&gt;
&lt;/hull&gt;

</PRE>
</DIV>

</BODY>
</HTML>
