<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alban Nanty">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>Describir el per&iacute;metro</Title>
</HEAD>
<BODY>
<H1>Describir el per&iacute;metro</H1>

<TABLE CLASS="XMLDescription">
<TR>
	<TD CLASS="Tilte">Sintaxis:</TD>
	<TD CLASS="XMLCode">&lt;hull&gt;<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;&lt;point&gt;<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;x&gt;...&lt;/x&gt;<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;y&gt;...&lt;/y&gt;<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;&lt;/point&gt;<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;...<BR>
		&lt;/hull&gt;	
	</TD>
</TR><TR>
	<TD CLASS="Tilte">Valor por defecto:</TD>
	<TD>Las 4 esquinas de una imagen definen su per&iacute;metro por defecto.</TD>
</TR><TR>
	<TD CLASS="Tilte">Descripci&oacute;n:</TD>
	<TD>El per&iacute;metro es un envoltorio convexo que contiene todas las extremidades de la pieza. Se define como una lista de puntos cuyos <FONT CLASS="Important">coordenadas est&aacute;n en p&iacute;xeles</FONT>, relativo a la esquina superior izquierda de imagen de la pieza.</TD>
</TR>
</TABLE>

<P>La descripci&oacute;n del per&iacute;metro es pr&aacute;ctico para piezas que no son ni cuadradas ni rectangulares, como las agujas y curvas. BlueBrick emplea ese per&iacute;metro para calcular la caja envoltorio de la pieza. La caja envoltorio es la caja rectangular m&aacute;s peque&ntilde;a posible (alineada con los ejes vertical y horizontal) que puede contener la pieza entera. Esta caja envoltorio se emplea cuando seleccionas una pieza pulsando sobre ella en el &aacute;rea de la biblioteca. Un buen per&iacute;metro aumenta el buen uso de la pieza. La definici&oacute;n del per&iacute;metro tambi&eacute;n influye en la cantidad de memoria empleada por BlueBrick. Esto es as&iacute; porque el tama&ntilde;o del per&iacute;metro influye en el tama&ntilde;o de la imagen necesario al girar la pieza. Por favor a&ntilde;ade el m&iacute;nimo de puntos necesario ya que esto influye en el rendimiento del programa.</P>

<P>Ten cuidado ya que, a diferencia de los par&aacute;metros anteriores, el per&iacute;metro se define en p&iacute;xeles, no en studs. La raz&oacute;n para ello es que es mucho m&aacute;s sencillo definir el per&iacute;metro en p&iacute;xeles, que se pueden encontrar con un editor de imagen, moviendo el cursor sobre la imagen. Una mala definici&oacute;n de per&iacute;metro puede resultar en una pieza truncada al girarla con un &aacute;ngulo libre. Al definir el per&iacute;metro de una pieza, una buena manera de comprobarlo  es girar la pieza hasta 360&deg; en peque&ntilde;os pasos como por ejemplo 22.5&deg; y comprobar en cada paso si la pieza no queda truncada. Abajo dos ejemplos de definici&oacute;n de per&iacute;metro de unas agujas 9V y una curva.</P>

<CENTER><IMG SRC="../HullSwitchPoint.png">&nbsp;&nbsp;&nbsp;&nbsp;<IMG SRC="../HullCurve.png"></CENTER>
<BR>

<DIV CLASS="TechNote">
<PRE><B>Este es el XML correspondiente para el per&iacute;metro de las agujas 9V:</B>

&lt;hull&gt;
    &lt;point&gt;
        &lt;x&gt;258&lt;/x&gt;
        &lt;y&gt;0&lt;/y&gt;
    &lt;/point&gt;
    &lt;point&gt;
        &lt;x&gt;280&lt;/x&gt;
        &lt;y&gt;52&lt;/y&gt;
    &lt;/point&gt;
    &lt;point&gt;
        &lt;x&gt;264&lt;/x&gt;
        &lt;y&gt;166&lt;/y&gt;
    &lt;/point&gt;
    &lt;point&gt;
        &lt;x&gt;0&lt;/x&gt;
        &lt;y&gt;166&lt;/y&gt;
    &lt;/point&gt;
    &lt;point&gt;
        &lt;x&gt;0&lt;/x&gt;
        &lt;y&gt;102&lt;/y&gt;
    &lt;/point&gt;
    &lt;point&gt;
        &lt;x&gt;19&lt;/x&gt;
        &lt;y&gt;53&lt;/y&gt;
    &lt;/point&gt;
&lt;/hull&gt;

</PRE>
</DIV>

<P>Nota que no tiene sentido crear un per&iacute;metro c&oacute;ncavo, ya que BlueBrick pasa por todos los puntos para crear la caja envoltorio. Es por ello que no hay enlace entre el &uacute;ltimo punto y el primero en este ejemplo.</P>

</BODY>
</HTML>
