<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alban Nanty">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>Describir los puntos de conexi&oacute;n</Title>
</HEAD>
<BODY>
<H1>Describir los puntos de conexi&oacute;n</H1>

<TABLE CLASS="XMLDescription">
<TR>
	<TD CLASS="Tilte">Sintaxis:</TD>
	<TD CLASS="XMLCode">&lt;ConnexionList&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;connexion&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;type&gt;...&lt;/type&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;position&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;x&gt;...&lt;/x&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;y&gt;...&lt;/y&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;/position&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;angle&gt;...&lt;/angle&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;angleToPrev&gt;...&lt;/angleToPrev&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;angleToNext&gt;...&lt;/angleToNext&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;nextConnexionPreference&gt;...&lt;/nextConnexionPreference&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;electricPlug&gt;...&lt;/electricPlug&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;/connexion&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;...<BR> &lt;/ConnexionList&gt;
	</TD>
</TR><TR>
	<TD CLASS="Tilte">Valor por defecto:</TD>
	<TD>Por defecto no hay ninguna conexi&oacute;n.</TD>
</TR><TR>
	<TD CLASS="Tilte">Descripci&oacute;n:</TD>
	<TD>Una lista de puntos de conexi&oacute;n. Lo hay l&iacute;mite en la lista y cada punto de conexi&oacute;n tien varios par&aacute;metros para ajustar.</TD>
</TR>  
</TABLE>

<P>El <span class="Important">campo type</span> es una id que representa el tipo de conexi&oacute;n. En BlueBrick solo las copnexiones del mismo tipo pueden conectarse entre si. Los dipos disponibles y el color que se emplea para representarlos en BlueBrick se definen en un archivo XML de configuraci&oacute;n llamado &quot;ConnectionTypeList.xml&quot; que se encuentra en la carpeta &quot;config&quot; de la carpeta de instalaci&oacute;n de BlueBrick. Lea <A HREF="Connection_Type_Config_File.htm">la secci&oacute;n &quot;Tipo de conexi&oacute;n&quot; del archivo de configuraci&oacute;n</A> para m&aacute;s detalles.</P>

<P>El <span class="Important">campo position</span> contiene las coordenadas de la conexi&oacute;n <span class="Important">en unidades de studs</span>, <span class="Important">relativo al centro de la pieza</span>. Primero hay que determinar la distancia de tu conector al centro de tu pieza en studs. En el siguiente ejemplo la distancia es de 8 studs en cualquier direcci&oacute;n. No hace falta especificar el centro de la pieza porque BlueBrick hace esto autom&aacute;ticamente. Cuando BlueBrick gira la pieza, es mucho m&aacute;s sencillo y eficiente girarlo sobre su centro. Es por eso que BlueBrick utiliza este sistema para hacer las coordenadas de los puntos de conexi&oacute;n.</P>

<CENTER><IMG SRC="../ConnectionPointAxisCross.png"></CENTER>

<P>Nota que <span class="Important">el eje Y va hacia abajo</span> (valores positivos cuanto m&aacute;s abajo). Normalmente es sencillo encontrar el centro de tu pieza basado en la geometr&iacute;a LEGO&copy; de la pieza. Por ejemplo, en el cruce de 9V de arriba es evidente que los 4 puntos de conexi&oacute;n est&aacute;n a 8 studs del centro. Pero si tienes una pieza compleja como las agujas de 9V de abajo, puedes encontrar el centro de la pieza basado en la imagen de la misma. Y luego, desde ese centro puedes calcular las posiciones de los puntos de conexi&oacute;n.</P>

<CENTER><IMG SRC="../ConnectionPointAxis.png"></CENTER>
<BR>

<DIV CLASS="TechNote">
Para calcular el centro de las agujas de 9V, podemos empezar con el tama&ntilde;o de la imagen de 279x166 p&iacute;xeles, dividirlo por la escala (1 stud = 8 p&iacute;xeles) y luego dividirlo entre 2 para llegar al centro.<BR> <B>Xcentro</B> = 279 p&iacute;xeles / 8 pixeles por stud / 2 = 17,4375 studs<BR> <B>Ycentro</B> = 166 p&iacute;xeles / 8 p&iacute;xeles por stud / 2 = 10,375 studs<BR> <BR> Estos dos valores son la distancia en studs entre el borde y el centro. Ahora sabes que el punto de conexi&oacute;n izquierdo est&aacute; a 0,5 ´studs del borde izquierdo y 4 studs del borde inferior, de modo que las coordenadas finales de ese punto de conexi&oacute;n son:<BR> <B>X</B><B>izquierda</B> = 0,5 - <B>centerX</B> = 0,5 - 17,4375 = -16,9375<BR> <B>Yizquierda</B> = <B>Ycentro</B> - 4 = 10,375 - 4 = 6,375<BR> <BR> Lo mismo sirve para calcular el punto de conexi&oacute;n de la derecha abajo:<BR> <B>XderechaAbajo</B> = 32,5 - <B>Xcentro</B> = 15,0625<BR> <B>YderechaAbajo</B> = <B>Yizquierda</B> = 6,375<BR> <BR> Para v&iacute;as curvas se pod&iacute;a usar un m&eacute;todo an&aacute;logo, pero normalmente se necesita una funci&oacute;n trigonom&eacute;trica para tomar en cuenta el &aacute;ngulo de giro y el radio de la curva. Por ejemplo, una curva de 9V tiene un radio de 40 studs (significa que si construyes un c&iacute;rculo con curvas de 9V, la distancia entre el centro del c&iacute;rculo y el centro de la v&iacute;a ser&aacute; de 40 studs).<BR> <BR> De modo que para calcular el punto de conexi&oacute;n de la derecha arriba imagina que a&ntilde;ades otra curva contraria. As&iacute; llegas a un punto con una ubicaci&oacute;n que conocemos exactamente, a una distancia de (16, -16) del punto de conexi&oacute;n inferior derecho:<BR> <B>XfinContraCurva</B> = <B>XderechaAbajo</B> + 16 = 15,0625 + 16 = 31,0625<BR> <B>YfinContraCurva</B> = <B>YderechaAbajo</B> - 16 = 6,375 - 16 = -9,625<BR> <BR> Y finalmente el punto de conexi&oacute;n de la derecha arriba es:<BR> <B>XsuperiorDerecha</B> = <B>XfinContraCurva</B> - radius * sin(angulo de la curva) = 31,0625 - 40 * sin(22.5&deg;) = 15,7552<BR> <B>YderechaArriba</B> = <B>YfinContraCurva</B> + radius * (1 - cos(angulo de la curva)) = -9,625 + 40 * (1 - cos(22,5&deg;)) = -6,58018
</DIV>

<P>El calculo de la posici&oacute;n es m&aacute;s dif&iacute;cil cuando la pieza no tiene una geometr&iacute;a simple, pero generalmente no revista mayor compliaci&oacute;n. El siguiente par&aacute;metro el <span class="Important">campo angle</span>. Este describe la orientaci&oacute;n del punto de conexi&oacute;n <span class="Important">en grados</span> comparado con la direcci&oacute;n del borde derecho. Ten cuidado, ya que como el eje Y es invertido en el sistema de coordenadas de las piezas el signo del &aacute;ngulo es inverso en relaci&oacute;n con la direcci&oacute;n trigonom&eacute;trica.</P>

<CENTER><IMG SRC="../ConnectionPointAngle.png"></CENTER>

<P>El <span class="Important">campo Angle to Previous</span> y <span class="Important">campo Angle to Next</span> son bastante similares a los anteriores par&aacute;metros. Indican la diferencia <span class="Important">en grados</span> entre este punto de conexi&oacute;n y el anterior o siguiente en la lista. El punto anterior de primer punto es el &uacute;ltimo punto y el punto siguiente al &uacute;ltimo es el primero, de modo que obtienes una lista circular. Ten cuidado por tanto si deseas reorganizar el orden de los puntos de conexi&oacute;n ya que habr&aacute; que modificar estos par&aacute;metros.</P>

<P>Bluebrick usa el orden de los puntos de conexi&oacute;n cuando giras una pieza que est&aacute; conectada a otra. BlueBrick gira la pieza de modo que conecta al siguiente punto de conexi&oacute;n en la lista. Por supuesto, si una pieza tiene diferentes tipos de puntos de conexi&oacute;n (como un paso a nivel que contiene puntos de conexi&oacute;n de v&iacute;as y de carreteras), tendr&aacute;s una lista circular diferente. Hay una lista por cada tipo de punto de conexi&oacute;n.</P>

<P>El <span class="Important">campo siguiente conexi&oacute;n preferida</span> es un &iacute;ndice con base 0 que apunta a una conexi&oacute;n en la lista. Este par&aacute;metro informa BlueBrick del punto de conexi&oacute;n que debe seleccionar de foema autom&aacute;tica despues de que el usuario haya colocado y conectado la pieza. Si miras una recta 9V recta como ejemplo, cuando el usuario conecta esta v&iacute;a por su punto de conexi&oacute;n izquierdo, quieres que se selecciones el punto de conexi&oacute;n derecho de forma autom&aacute;tica para facilitar la conexi&oacute;n de nuevas piezas. Lo mismo aplica si conectas la pieza por el punto de conexi&oacute;n derecho en cuyo caso querr&aacute;s tener seleccionado el punto izquierdo.</P>

<P>Normalmente una conexi&oacute;n no debe apuntar a si mismo como preferencia (a menos que sea el &uacute;nico punto de conexi&oacute;n de la pieza). De lo contrario acabar&aacute;s apilado las piezas. En el caso de las agujas 9V, ver&aacute;s que si conectas esta pieza por el punto de conexi&oacute;n izquierdo, el punto de conexi&oacute;n de la derecha abajo se seleccionar&aacute; y si conectas con cualquiera de los de la derecha se seleccionar&aacute; el de la izquerda.</P>

<DIV CLASS="TechNote">
<PRE>&lt;ConnexionList&gt;
<FONT COLOR="blue">+-?</font> &lt;connexion&gt;
<FONT COLOR="blue">¦</font> <FONT COLOR="green">+---</font> &lt;nextConnexionPreference&gt;<B><FONT COLOR="green">1</font></B>&lt;/nextConnexionPreference&gt;
<FONT COLOR="blue">¦</font> <FONT COLOR="green">¦</font> &lt;/connexion&gt;
<FONT COLOR="blue">¦</font> <FONT COLOR="green">+?</font>&lt;connexion&gt;
<FONT COLOR="blue">+----</font> &lt;nextConnexionPreference&gt;<B><FONT COLOR="blue">0</font></B>&lt;/nextConnexionPreference&gt;
<FONT COLOR="blue">¦</font>    &lt;/connexion&gt;
<FONT COLOR="blue">¦</font>    &lt;connexion&gt;
<FONT COLOR="blue">+----</font> &lt;nextConnexionPreference&gt;<B><FONT COLOR="blue">0</font></B>&lt;/nextConnexionPreference&gt;
      &lt;/connexion&gt;
&lt;/ConnexionList&gt;</PRE>
</DIV>

<P>Finalmente, el <span class="Important">campo Electric Plug</span> se usa para v&iacute;as con circuito el&eacute;ctrico (9V y 12V) de modo que puedes omitirlo en la mayor&iacute;a de piezas. El campo contiene una integral que puede ser positiva o negativa. Valores diferentes indican circuitos independientes que no est&aacute;n conectados el&eacute;ctricamente con la la pieza. Por ejemplo, si tomas el cruce de vias 32087 o un pao a nivel con dos v&iacute;as paralelas, una l&iacute;nea se identificar&aacute; con los n&uacute;meros +1/-1 y la otra con os n&uacute;meros +2/-2.</P>
<P>Las conexiones con valores positivos se conectan el&eacute;ctricamente con conexiones con el mismo valor negativo. Esto significa que un enlace el&eacute;ctrico +1 se conecta con todas las conexiones  con un enlace con -1 y viceversa. Pero un +1 nunca se conectar&aacute; con un -2 u otro +1. Vea la imagen abajo para un ejemplo.</P>

<CENTER><IMG SRC="../ElectricPlug.png"></CENTER>

</BODY>
</HTML>
