<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alban Nanty">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>Formato de piezas</Title>
</HEAD>
<BODY>
<H1>Formato de la imagen de las piezas</H1>
<H2>Formato</H2>
<P>Al crear la biblioteca de piezas, BlueBrick s&oacute;lo analiza los ficheros .GIF de las subcarpetas dentro de la carpeta &quot;/parts&quot; donde se ubican las piezas (para m&aacute;s detalles consultar <A HREF="Part_Library_Folders.htm">Organizaci&oacute;n de carpetas</A>). La imagen GIF puede contener el color transparente, de hecho es &uacute;til usarlo para el fondo si la pieza no ocupa toda la superficie de la imagen (p.ej. tramos de v&iacute;as).</P>
<P>No importa cual en qu&eacute; orientaci&oacute;n se coloque la vista superior de la pieza en la imagen, pero para facilitar la integraci&oacute;n de tu pieza con LDraw, es recomendable usar la misma orientaci&oacute;n que en LDraw. En otro caso, deber&iacute;as a&ntilde;adir informaci&oacute;n de mapeo en la <A HREF="LDraw_Remaping_File.htm">Secci&oacute;n LDraw de tu archivo XML</A>.</P>

<H2>Escala</H2>
<P>Esto es lo m&aacute;s importante: La escala de una pieza es <FONT CLASS="Important">1 stud = 8 pixeles</FONT>. Como en realidad un stud mide 8mm, otra manera de memorizar esta escala es 1 pixel = 1 mil&iacute;metro.</P>

<H2>Caracteres permitidos en el nombre de archivo</H2>
<P>Los nombres de las piezas pueden usar indistintamente may&uacute;sculas o min&uacute;sculas, ya que BlueBrick convertir&aacute; todos los nombres en may&uacute;sculas al crear su biblioteca de piezas. As&iacute; pues, si creas dos piezas con el mismo nombre pero usando de forma distinta las may&uacute;sculas y minusculas, se considerar&aacute;n como la misma pieza. Se puede utilizar cualquier caracter autorizado para poner nombre a tus piezas (inclu&iacute;dos los espacios), pero se recomienda encarecidamente utilizar s&oacute;lo caracteres ingleses (sin tildes ni letras raras) para facilitar la compartici&oacute;n de tus dise&ntilde;os y piezas internacionalmente. Tambi&eacute;n debes evitar el uso del punto, ya que este cadacter se utiliza para separar el nombre del fichero de su extensi&oacute;n y tambi&eacute;n puede ser utilizado por BlueBrick para separar el n&uacute;mero de pieza de su color.</P>
<p>However since the filenames on GNU/Linux OS are case sensitive, the ".xml" and ".gif" extensions <FONT CLASS="Important"> must be lower case</FONT> in order for BlueBrick to correctly find the parts on Linux.</p>
<H2>Convenci&oacute;n de nombres de archivo</H2>
<P>A BlueBrick le da igual el nombre que le des a tus piezas. La &uacute;nica restricci&oacute;n es que el nombre debe ser &uacute;nico en toda la librer&iacute;a. No puedes dar a dos piezas el mismo nombre incluso si est&aacute;n en carpetas distintas. Es m&aacute;s, este nombre se convertir&aacute; en un ID &uacute;nico que se grabar&aacute; en los ficheros .BBM de tu dise&ntilde;o. Para evitar conflictos entre los nombres de las piezas de la biblioteca y hacer tus ficheros .BBM f&aacute;ciles de compartir, <FONT CLASS="Important">habitualmente se emplea el numero de la pieza o set</FONT> como nombre de archivo. Esto es tan solo una pr&aacute;ctica de uso com&uacute;n, pero recomiendo encarecidamente que se siga este criterio. Este es el criterio seguido por la Biblioteca Oficial de Piezas BlueBrick.</P>

<H3>Convenci&oacute;n de nombres para sets.</H3>
<P>Como algunas piezas que tienen el mismo n&uacute;mero que sets de Lego&copy;, para evitar conflictos, la pr&aacute;ctica com&uacute;n es a&ntilde;adir &quot;.SET&quot; como sufijo del n&uacute;mero de set. No utilices un sufijo num&eacute;rico como &quot;.1&quot; ya que este sufijo ser&iacute;a interpretado como un color (ver m&aacute;s abajo para m&aacute;s detalles), y la informaci&oacute;n de color es irrelevante para un set. Adem&aacute;s, Peeron y BrickLink tambi&eacute;n utilizan un gui&oacute;n seguido de un n&uacute;mero para diferenciar las piezas de los sets, y tambi&eacute;n por que se se produjeron distintos sets con los mismos n&uacute;meros a lo largo del tiempo. As&iacute; pues, es recomendable utilizar el sufijo &quot;.set&quot; con los mismos n&uacute;meros de set que se usan en Peeron y BrickLink. En el siguiente cuadro tienes ejemplos que, adem&aacute;s muestran como nombrar diferentes im&aacute;genes para las partes de un set, o modelos alternativos de un mismo set.</P>

<DIV class="TechNote">
<PRE><PRE>&lt;N&uacute;meroDeSet&gt;.set.gif
&lt;N&uacute;meroDeSet&gt;.set.xml

Por ejemplo la convenci&oacute;n para nombrar el set #2150 es:
<B>2150-1.set.gif</B>

Adem&aacute;s, si quieres separar un set en diferentes im&aacute;genes gif, you can name them roughly according to what the splitted part represents like:
7945-1.station.gif
7945-1.truck.gif
etc...
And it would be nice to add an xml file to group them, and which you can name *.set.xml, like:
7945-1.set.xml

Si quieres hacer GIFs de modelos alternativos de LEGO que est&aacute;n contenidos dentro de un set, la convenci&oacute;n para nombrarlos es como sigue:
4886-1.set_option_1.gif
4886-1.set_option_2.gif
4886-1.set_option_3.gif
etc...</PRE>
</DIV>

<H3>Convenci&oacute;n de nombres para piezas</H3>

<P>El est&aacute;ndar com&uacute;n para nombrar una pieza de LEGO&copy; es la de usar el n&uacute;mero completo de la pieza seguido de un punto seguido del c&oacute;digo de color seg&uacute;n la tabla de colores de LDraw y, finalmente, una extensi&oacute;n. El siguiente caso ilustra con un ejemplo el uso de los c&oacute;digos LDraw:</P>

<DIV class="TechNote">
<PRE>&lt;N&uacute;meroDePieza&gt;.&lt;Color&gt;.gif
&lt;N&uacute;meroDePieza&gt;.&lt;Color&gt;.xml

Por ejemplo, la convenci&oacute;n para nombrar un baseplate az&uacute;l 32x32 es:
<B>3811.1.gif</B>

<B>La tabla de color de LDraw es:</B>
  0 Black               28 Dark Tan               134 Pearl Copper
  1 Blue                29 Light Purple           135 Pearl Gray
  2 Green               33 Trans Blue             137 Pearl Sand Blue
  3 Teal                34 Trans Green            142 Pearl Gold
  4 Red                 36 Trans Red              151 Light Stone
  5 Dark Pink           37 Trans Violet           256 Rubber Black
  6 Brown               40 Trans Gray             272 Dark Blue
  7 Gray                41 Trans Light Cyan       273 Rubber Blue
  8 Dark Gray           42 Trans Flu Lime         288 Dark Green
  9 Light Blue          45 Trans Pink             313 Maersk Blue
 10 Bright Green        46 Trans Yellow           320 Dark Red
 11 Turquiose           47 Clear                  324 Rubber Red
 12 Light Red           57 Trans Flu Orange       334 Chrome Gold
 13 Pink                69 Bright Purple          335 Sand Red
 14 Yellow              70 Reddish Brown          366 Earth Orange
 15 White               71 Stone Gray             373 Sand Violet
 17 Light Green         72 Dark Stone Gray        375 Rubber Gray
 18 Light Yellow        73 Medium Blue            378 Sand Green
 19 Tan                 74 Medium Green           379 Sand Blue
 20 Light Violet        77 Paradisa Pink          383 Chrome Silver
 21 Phosphor White      78 Light Flesh            462 Light Orange
 22 Violet              79 Translucent White      484 Dark Orange
 23 Violet Blue         85 Medium Lilac           494 Electric Contact
 25 Orange              86 Dark Flesh             503 Light Gray
 26 Magenta             89 Royal Blue             511 Rubber White
 27 Lime                92 Flesh</PRE>
</DIV>

<H3>Convenci&oacute;n de nombres para grupos (which is not a set)</H3>

<P>El nombre de archivo de un grupo de piezas (piezas hechas a partir de otras piezas organizadas con una distribuci&oacute;n determinada), deber&iacute;a comenzar con un nombre que describa el grupo seguido por un punto, y entonces la palabra &quot;group&quot; seguida finalmente de la extensi&oacute;n. Las piezas de grupo nunca tienen un fichero .GIF asociado, s&oacute;lo otros ficheros .XML. Si quieres hacer un grupo que represente en realidad un set (por ejemplo, un set que incluya varios edificios en una distribuci&oacute;n concreta), utiliza en su lugar la convenci&oacute;n para nombres de sets indicada m&aacute;s arriba..</P>

<DIV class="TechNote">
  <PRE>&lt;GroupName&gt;.group.xml

Por ejemplo, la convenci&oacute;n de nombre para una v&iacute;a flexible podr&iacute;a ser:
<B>flex.group.xml</B></PRE>
</DIV>

</BODY>
</HTML>
