<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alban Nanty">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>Descripci&oacute;n XML de las piezas</Title>
</HEAD>
<BODY>
<H1>Descripci&oacute;n XML de las piezas</H1>
<H2>Sinopsis</H2>

<P>Para cada archivo GIF en la biblioteca de piezas puedes crear un archivo XML con el mismo nombre Este archivo XML contendr&aacute; informaci&oacute;n pr&aacute;ctica para describir las propiedades de tu pieza como sus diferentes puntos de conexi&oacute;n. Pero BlueBrick puede asignar un comportamiento por defecto a la pieza si no creas un archivo XML, de modo que este archivo es opcional. El nombre del archivo XML debe ser exactamente el mismo que el del archivo GIF, con la excepci&oacute;n de la extensi&oacute;n por supuesto.</P>

<P>Puedes duplicar un archivo XML existente y modificarlo para trabajar m&aacute;s r&aacute;pido. Ten cuidado, las etiquetas XML requieren correspondencia exacta de may&uacute;sculas y min&uacute;sculas. Todos los campos son opcionales y el orden de los campos no importa. Si falta un campo se usar&aacute; el ajuste por defecto en su lugar.</P>

<DIV Class="ToTranslate">
<H2>File Encoding</H2>

<P>For a good cross platform compatibility, you should clearly indicate in the header of the xml file the encoding in which the file is saved. The prefered encoding is UTF-8, because it can save accentuated character for the part description in different languages. Use a text editor to save your XML file in UTF-8. For example with Windows Notepad, choose the correct encoding in the save dialog:</P>

<CENTER><IMG SRC="XmlEncoding.png"></CENTER>

<P>And make sure the header of your file starts with this line:</P>

<DIV CLASS="TechNote">
<PRE>
&lt;?xml version="1.0" <FONT COLOR="red">encoding="UTF-8"</FONT>?&gt;
</PRE>
</DIV>
</DIV>

<H2>Estructura del archivo XML</H2>

<P>Si no sabes lo que es un archivo XML, y no est&aacute;s familiarizado con su sintaxis, te recomiendo en&eacute;rgicamente que busques ayuda adicional en internet. Para resumirlo e pocas palabras, este formato organiza la informaci&oacute;n en un &aacute;rbol jer&aacute;rquico por medio de etiquetas que se identifican por estar dentro de los caracteres &lt; y &gt;. Esta es una estructura general de un archivo XML de una pieza:</P>

<DIV CLASS="TechNote">
<PRE>
&lt;?xml version="1.0" encoding="UTF-8"?&gt;
&lt;part&gt;
    &lt;Author&gt;...&lt;/Author&gt;
    &lt;Description&gt;
        &lt;en&gt;...&lt;/en&gt;
        ...
    &lt;/Description&gt;
    &lt;ImageURL&gt;...&lt;/ImageURL&gt;
    &lt;NotListedInLibrary&gt;...&lt;/NotListedInLibrary&gt;
    &lt;OldNameList&gt;
        ...
    &lt;/OldNameList&gt;
    &lt;SnapMargin&gt;
        ...
    &lt;/SnapMargin&gt;
    &lt;ConnexionList&gt;
        &lt;connexion&gt;
            ...
        &lt;/connexion&gt;
        ...
    &lt;/ConnexionList&gt;
    &lt;hull&gt;
        &lt;point&gt;
            ...
        &lt;/point&gt;
        ...
    &lt;/hull&gt;
    &lt;TrackDesigner&gt;
        ...
    &lt;/TrackDesigner&gt;
    &lt;LDraw&gt;
        ...
    &lt;/LDraw&gt;
&lt;/part&gt;</PRE>
</DIV>

<H2>Las diferentes etiquetas XML en detalle</H2>

<P>Para una descripci&oacute;n detallada de cada etiqueta XML, lea las siguientes secciones:</P>

<UL>
	<LI><A HREF="Part_XML_Description_Author.htm">Especificar autor</A> (f&aacute;cil)</LI>
	<LI><A HREF="Part_XML_Description_Description.htm">A&ntilde;adir una descripci&oacute;n en un idioma diferente</A> (f&aacute;cil)</LI>
	<LI><A HREF="Part_XML_Description_Image.htm">Especificar una imagen de referencia online</A> (f&aacute;cil)</LI>
	<LI><A HREF="Part_XML_Description_NotListedInLibrary.htm">Especificar si la pieza debe ser escondida</A> (f&aacute;cil)</LI>
	<LI><A HREF="Part_XML_Description_OldName.htm">Seguir la pista del nombre anterior de luna pieza</A> (f&aacute;cil)</LI>
	<LI><A HREF="Part_XML_Description_Margin.htm">Especificar los m&aacute;rgenes para autoajuste</A> (dificultad media)</LI>
	<LI><A HREF="Part_XML_Description_Connection.htm">Describir los puntos de conexi&oacute;n</A> (dif&iacute;cil)</LI>
	<LI><A HREF="Part_XML_Description_Hull.htm">Describir el per&iacute;metro</A> (dificultad media)</LI>
	<LI><A HREF="Part_XML_Description_Track_Designer.htm">A&ntilde;adir informaci&oacute;n para comptibilidad con Track Designer</A> (dif&iacute;cil)</LI>
	<LI><A HREF="Part_XML_Description_LDRAW.htm">A&ntilde;adir informaci&oacute;n para comptibilidad con LDraw</A> (dif&iacute;cil)</LI>
<UL>


</BODY>
</HTML>
