<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alban Nanty">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>Describir el per&iacute;metro</Title>
</HEAD>
<BODY>
<H1>Describir el per&iacute;metro</H1>

<TABLE CLASS="XMLDescription">
<TR>
	<TD CLASS="Tilte">Sintaxis:</TD>
	<TD CLASS="XMLCode">&lt;hull&gt;<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;&lt;point&gt;<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;x&gt;...&lt;/x&gt;<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;y&gt;...&lt;/y&gt;<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;&lt;/point&gt;<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;...<BR>
		&lt;/hull&gt;	
	</TD>
</TR><TR>
	<TD CLASS="Tilte">Valor por defecto:</TD>
	<TD>Las 4 esquinas de una imagen definen su per&iacute;metro por defecto.</TD>
</TR><TR>
	<TD CLASS="Tilte">Descripci&oacute;n:</TD>
	<TD>El per&iacute;metro es un envoltorio convexo que contiene todas las extremidades de la pieza. Se define como una lista de puntos cuyos <FONT CLASS="Important">coordenadas est&aacute;n en p&iacute;xeles</FONT>, relativo a la esquina superior izquierda de imagen de la pieza.</TD>
</TR>
</TABLE>

<DIV CLASS="ToTranslate"><P>La descripci&oacute;n del per&iacute;metro es pr&aacute;ctico para piezas que no son ni cuadradas ni rectangulares, como las agujas y curvas. BlueBrick emplea ese per&iacute;metro para calcular la caja envoltorio de la pieza. La caja envoltorio es la caja rectangular m&aacute;s peque&ntilde;a posible (alineada con los ejes vertical y horizontal) que puede contener la pieza entera. Un buen per&iacute;metro aumenta el buen uso de la pieza. La definici&oacute;n del per&iacute;metro tambi&eacute;n influye en la cantidad de memoria empleada por BlueBrick. Esto es as&iacute; porque el tama&ntilde;o del per&iacute;metro influye en el tama&ntilde;o de la imagen necesario al girar la pieza. Usually a convex hull is good enough, but you may want to define a concave hull to improve the picking selection. Generally speaking, por favor a&ntilde;ade el m&iacute;nimo de puntos necesario ya que esto influye en el rendimiento del programa.</P></DIV>

<P>Ten cuidado ya que, a diferencia de los par&aacute;metros anteriores, el per&iacute;metro se define en p&iacute;xeles, no en studs. La raz&oacute;n para ello es que es mucho m&aacute;s sencillo definir el per&iacute;metro en p&iacute;xeles, que se pueden encontrar con un editor de imagen, moviendo el cursor sobre la imagen.</P>

<DIV CLASS="ToTranslate"><P>BlueBrick actually shifts the pixel coordinates that you define in the XML file of 0.5 (half a pixel), in order to set the coordinate at the center of the pixel. However, note that you can use decimal values to define the pixel coordinates in the XML file. It is also allowed to use coordinates which are outside the image (i.e. negative value or value greater than the size of the image).</P></DIV>

<P>Una mala definici&oacute;n de per&iacute;metro puede resultar en una pieza truncada al girarla con un &aacute;ngulo libre. <DIV CLASS="ToTranslate">When you are specifying the hull of your part, a good way to verify it is to draw the Hull by choosing the <font class="Path">&nbsp;View &gt; Hulls &gt; Bricks&nbsp;</font> menu. Here are two examples: one for the hull definition of the 9V Switch Point Track which is a precise concave hull such as you can click around the yellow lever without selecting it; and one for the 9V Curved Track which is a good enough convex hull.</div></P>

<CENTER><IMG SRC="../HullSwitchPoint.png">&nbsp;&nbsp;&nbsp;&nbsp;<IMG SRC="../HullCurve.png"></CENTER>
<BR>

<DIV CLASS="TechNote">
<PRE><B>Este es el XML correspondiente para el per&iacute;metro de las curva 9V:</B>

&lt;hull&gt;
    &lt;point&gt;
        &lt;x&gt;0&lt;/x&gt;
        &lt;y&gt;0&lt;/y&gt;
    &lt;/point&gt;
    &lt;point&gt;
        &lt;x&gt;74&lt;/x&gt;
        &lt;y&gt;5&lt;/y&gt;
    &lt;/point&gt;
    &lt;point&gt;
        &lt;x&gt;138&lt;/x&gt;
        &lt;y&gt;26&lt;/y&gt;
    &lt;/point&gt;
    &lt;point&gt;
        &lt;x&gt;138&lt;/x&gt;
        &lt;y&gt;38&lt;/y&gt;
    &lt;/point&gt;
    &lt;point&gt;
        &lt;x&gt;121&lt;/x&gt;
        &lt;y&gt;77&lt;/y&gt;
    &lt;/point&gt;
    &lt;point&gt;
        &lt;x&gt;114&lt;/x&gt;
        &lt;y&gt;85&lt;/y&gt;
    &lt;/point&gt;
    &lt;point&gt;
        &lt;x&gt;0&lt;/x&gt;
        &lt;y&gt;64&lt;/y&gt;
    &lt;/point&gt;
&lt;/hull&gt;

</PRE>
</DIV>

</BODY>
</HTML>
