<HTML>
<HEAD>
<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alban Nanty">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>The Part Library Organization and Display Preferences</Title>
</HEAD>
<BODY>
<H1>Organizaci&oacute;n de la Biblioteca de piezas y preferencias de visualizac&iacute;on</H1>

<h2>Organizaci&oacute;n de pesta&ntilde;as</h2>
<p>La biblioteca est&aacute; organizada en pesta&ntilde;as. Ten en cuenta que estas pesta&ntilde;as aparecer&aacute;n siempre en ingl&eacute;s sea cual sea el lenguaje que elijas en el programa. Esto es as&iacute; porque los t&iacute;tulos de las pesta&ntilde;as son los nombres de las carpetas en las que se guardan las piezas. Si cambias el nombre de las subcarpetas de la carpeta de piezas &quot;/parts&quot; de Bluebrick, este cambio se reflejar&aacute; en los nombres de las pesta&ntilde;as (despu&eacute;s de recargar la biblioteca con el men&uacute;<font class="path">&nbsp;Archivo &gt; recargar biblioteca de piezas&nbsp;</font> o reiniciando BlueBrick). Es seguro hacer este cambio porque BlueBrick no utiliza el nombre de las carpetas para referenciar las piezas en tu dise&ntilde;o.</p>
<p>Algunas piezas de la biblioteca oficial pueden cambiarse de pesta&ntilde;a en un cambio de versi&oacute;n de BlueBrick, debido a la reorganizaci&oacute;n del Gestor de Piezas (una persona que es generalmente un miembro de la comunidad de aficionados a LEGO<sup>&#174;</sup>), lo cual tampoco afecta a los dise&ntilde;os creados por los usuarios de BlueBrick.</p>
<p>La pesta&ntilde;a &quot;CUSTOM&quot; (&quot;personalizada&quot;) contiene algunas piezas no oficiales, adem&aacute;s delas piezas que puedes crear tu mismo agrupando piezas existentes (consulta la secci&oacute;n <A HREF="Part_Library_Save_a_Group_in_the_Library.htm">C&oacute;mo guardar un grupo en la biblioteca</A>). Despu&eacute;s de guardar tu grupo en la pesta&ntilde;a &quot;CUSTOM&quot; puedes sentirte libre de moverlo a otra pesta&ntilde;a, o incluso puedes a&ntilde;adir una nueva pesta&ntilde;a creada por ti mismo. Algunas piezas de la pesta&ntilde;a CUSTOM se incluyen para mantener la compatibilidad con Track Designer.</p>
<p>Dentro de cada pesta&ntilde;a, las piezas se ordenan en primer lugar con su &quot;clave de ordenaci&oacute;n&quot; que est&aacute; definida en el fichero .XML de la pieza, y a continuaci&oacute;n mediante su nombre (consulta la secci&oacute;n <A HREF="Part_XML_Description_SortingKey.htm">Clave de ordenaci&oacute;n </A>para m&aacute;s detalles). La &quot;clave de ordenaci&oacute;n&quot; de las piezas oficiales las elige el Gestor de Piezas quien, normalmente, utiliza categor&iacute;as para agrupar las piezas de una forma l&oacute;gica, como por ejemplo:  Creator, City, Modular, etc...</p>

<p>El orden en el que aparecen las pesta&ntilde;as en la biblioteca tambi&eacute;n se puede personalizar para permitirte mostrar las pesta&ntilde;as que usas m&aacute;s en el principio. Para cambiar el orden de las pesta&ntilde;as, consulta la secci&oacute;n <A HREF="Preferences_Part_Library.htm">Preferencias de la Biblioteca</A>.</p>

<h2>Piezas oficiales</h2>

<p>BlueBrick est&aacute; encantado de acoger en su Biblioteca Oficial de Piezas todos los sets oficiales LEGO<sup>&#174;</sup> jutno a las piezas individuales que son &uacute;tiles para tus dise&ntilde;os, como baseplates, carreteras y v&iacute;as de tren. La Biblioteca Oficial tambi&eacute;n puede almacenar algunas modificaciones comunmente adoptadas entre la comunidad de aficionados a LEGO<sup>&#174;</sup> como, por ejemplo, tramos de v&iacute;as de la mitad de largo. No obstante, la biblioteca no pretende alojar todas las piezas LEGO<sup>&#174;</sup> que existen, como hace la biblioteca LDraw. De todos modos, la Biblioteca Oficial sigue las mismas convenciones de nombre de LDraw para evitar conflictos de nombres</p>
<p>Desde la introducci&oacute;n de la  <A HREF="Creating_Modifying_Layouts_Grouping_Parts.htm">funcionalidad de agrupado</a> en BlueBrick, los ests oficiales a menudo se implementan como un grupo que puede ser desagrupado una vez que se a&ntilde;ade al dise&ntilde;o. As&iacute;, si s&oacute;lo se necesita un subelemento de un set para tu dise&ntilde;o, en primer lugar deber&aacute;s buscar el set completo en la biblioteca, entonces deber&aacute;s a&ntilde;adirlo a tu dise&ntilde;o, y una vez all&iacute; desagruparlo. Por &uacute;ltimo podr&aacute;s seleccionar el subelemento que necesitas y borrar el resto.</p>

<img align="left" style="padding-right:16px" src="../TownPlan.png">

<p>La distribuci&oacute;n de los subelementos en un set oficial intenta seguir la distribuci&oacute;n mostrada en la caja, pero si no te gusta, puedes desagrupar el set y recolocar sus partes (por ejemplo, puedes mover el coche del set lejos de los edificios).</p>

<p>Algunos sets oficiales tienen piezas de bisagra (como, por ejemplo, una casa que se pueda abrir en dos partes) que por norma general se implementan con la  <a href="Creating_Modifying_Layouts_Using_Flex_Track.htm">Funcionalidad de flexibilidad</a>, por lo que podr&aacute;s ajustar la posici&oacute;n de apertura si no te gusta la que aparece por defecto (como puede mostrarse en el set del Town Plan en la imagen superior).</p>
<h2>Varias preferencias de visualizaci&oacute;n</h2>

<P>La apariencia de cada pieza en la librer&iacute;a se puede ajustar haciendo clic con el bot&oacute;n derecho sobre ella. Aparecer&aacute; un men&uacute; contextual en el cual podr&aacute;s elegir varias opciones:</P>
<ul>
	<li><b>Iconos grandes:</b> Te permite elegir mostrar las piezas con iconos grandes, para ver con m&aacute;s claridad los detalles de cada pieza, o con iconos peque&ntilde;os, para ver m&aacute;s piezas a la vez.</li>
	<li><b>Respetar proporciones:</b> A veces es dif&iacute;cil juzgar el tama&ntilde;o de una pieza comparado con otra. Es el caso t&iacute;pico de las baseplates, en las que quieres distinguir de un vistazo las grandes de las peque&ntilde;as. As&iacute;, si eliges respetar las proporciones, cada pieza mantendr&aacute; su tama&ntilde;o de forma proporcional a la pieza m&aacute;s grande de esa pesta&ntilde;a. En cualquier caso, esto puede provocar que se creen vistas previas de las piezas sumamente peque&ntilde;as si existe una pieza muy grande en esa pesta&ntilde;a, por lo que esta opci&oacute;n no es muy pr&aacute;ctica en la pesta&ntilde;a TOWN por ejemplo. En ese caso, si no se seleccionara esta opci&oacute;n, cada vista previa de las piezas de la biblioteca ocupar&aacute; todo el espacio disponible.</li>
	<li><b>Burbuja de Informaci&oacute;n:</b> Si se activa esta opci&oacute;n, cuando muevas el cursor sobre una pieza aparecer&aacute; una burbuja amarilla mostrando informaci&oacute;n variada de la pieza. puedes personalizar la informaci&oacute;n qeu quieres que se muestre en la secci&oacute;n de <A HREF="Preferences_Part_Library.htm">Preferencias de la Biblioteca de Referencias</A>. Ten encuenta que esta informaci&oacute;n tambi&eacute;n se muestra en la Barra de estado inferior, incluso si esta opci&oacute;n no est&aacute; activada.</li>
</ul>
</BODY>
</HTML>