<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alban Nanty">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>A&ntilde;adir informaci&oacute;n para compatibilidad con Track Designer</Title>
</HEAD>
<BODY>
<H1>A&ntilde;adir informaci&oacute;n para compatibilidad con Track Designer</H1>

<TABLE CLASS="XMLDescription">
<TR>
	<TD CLASS="Tilte">Sintaxis:</TD>
	<TD CLASS="XMLCode">&lt;TrackDesigner&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;ID&gt;...&lt;/ID&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;Flag&gt;...&lt;/Flag&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;HasSeveralGeometries&gt;...&lt;/HasSeveralGeometries&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;TDBitmapList&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;TDBitmap&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;BBConnexionPointIndex&gt;...&lt;/BBConnexionPointIndex&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;Type&gt;...&lt;/Type&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;AngleBetweenTDandBB&gt;...&lt;/AngleBetweenTDandBB&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;/TDBitmap&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;...<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;/TDBitmapList&gt;<BR> &lt;/TrackDesigner&gt;<BR> <BR> <BR> <I>Nota: La etiqueta &lt;ID&gt; se puede cambiar por una lista de ids con la siguiente sintaxis:</I><BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;IDList&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;ID registry=&quot;...&quot;&gt;...&lt;/ID&gt;<BR> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;...<BR> &nbsp;&nbsp;&nbsp;&nbsp;&lt;/IDList&gt;<BR>
	</TD>
</TR><TR>
	<TD CLASS="Tilte">Valor por defecto:</TD>
	<TD>Si no hay etiqueta &lt;TrackDesigner&gt;, la pieza no es compatible con TrackDesigner.</TD>
</TR><TR>
	<TD CLASS="Tilte">Descripci&oacute;n:</TD>
	<TD>Un conjunto de informaci&oacute;n usado por BlueBrick para convertir a piezas  de Track Designer a BlueBrick y viceversa.</TD>
</TR>  
</TABLE>

<P>BlueBrick puede guardar y cargar archivos en formato Track Designer (TDL). Ya que el n&uacute;mero de las piezas y otros datos son diferentes entre BlueBrick y Track Designer, BlueBrick necesita tener informaci&oacute;n sobre c&oacute;mo convertir el archivo al guardarlo en foemato TDL.</P>

<P>Normalmente solo necesitas a&ntilde;adir esta etiqueta XML si a&ntilde;ades una pieza usada en Track Designer. BlueBrick ya viene con soporte completo para la biblioteca por defecto de Track Designer, de modo que probablemente nunca tendr&aacute;s que a&ntilde;adir esta informaci&oacute;n. Sin embargo, como Track Designer tambi&eacute;n tiene la posibilidad de ampliar la biblioteca, puede suceder que quieras a&ntilde;adir soporte para una pieza que hayas creado para BlueBrick (para poder cargar un archivo TDL creado con tu biblioteca personalizada de TD).</P>

<P>El <FONT CLASS="Important">campo ID</FONT> contiene la ID completa de Track Designer (esto puede verse en las ventana de propiedades de las piezas, haciendo un clic derecho sobre una pieza en Tarck Designer y seleccionando &quot;Properties&quot;). Esta ID se usa para crear un v&iacute;nculo entre la pieza en Track Designer y la correspondiente pieza en BlueBrick. No existe valor por defecto, de modo que este campo siempre tiene que tener un valor.</P>

<P>Como es posible asignar cualquier ID a una pieza en el registro de TD, puede suceder que la misma pieza tenga diferentes IDs en diferentes registros personalizados, haci&eacute;ndolos incompatibles. BlueBrick sin embargo es capaz de cargar dos archivos TDL diferentes, guardados con registros incompatibles. Si se sabe que una pieza tiene diferentes IDs en distintos registros TD, puedes reemplazar el <FONT CLASS="Important">campo ID</FONT> por un <FONT CLASS="Important">campo IDList</FONT> en el cual enumeras todos los IDs conocidos.</P>

<P>El <FONT CLASS="Important">campo ID</FONT> contiene una atributo llamado <FONT CLASS="Important">registry</FONT>. El valor de este atributo es una palabra clave que hace referencia al registro en el cual la pieza tiene esta ID. Como pa&ntilde;abra clave se puede emplear el nombre del LUG/LTC que emplea ese registro, o el nombre de la p&aacute;gina web que distribuye este registro. Luego, en la carpeta &quot;config&quot; de la carpeta de instalaci&oacute;n de BlueBrick, puede encontrar el archivo de configuraci&oacute;n llamado &quot;TDRegistryList.txt&quot; en el cual puedes asociar la palabra clave con el nombre real de la pieza en el registro.</P>

<P>El <FONT CLASS="Important">campo Flag</FONT> contiene un valor &iacute;ntegro que Track Designer necesita. Este campo solo puede tener uno de 4 valores:
<UL>
	<LI>0 = sin valor</LI>
	<LI>1 = la pieza est&aacute; conectada</LI>
	<LI>2 = la pieza se emplea para apuntalar una elevaci&oacute;n</LI>
	<LI>3 = la pieza es accesoria y se emplea para apuntalar una elevaci&oacute;n</LI>
</UL>
Desafortunadamente no hay manera de encontrar este Flag en el registro de piezas de Track Designer. Sospecho que estas Flags se computan de forma din&aacute;mica, pero como no s&eacute; c&oacute;mo computarlas, por ahora las a&ntilde;ado como valores fijos en la descripci&oacute;n XML. Normalmente puedes usar 0 como valor por defecto. BlueBrick tambi&eacute;n usa 0 como valor por defecto.</P>

<P>El <FONT CLASS="Important">campo HasSeveralGeometries </FONT> contiene una marca booleana(&quot;true&quot; o &quot;false&quot; en min&uacute;sculas y sin las comillas) para saber si la pieza tiene diferentes <I>Geometries</I> en Track Designer. Para saber si una pieza tiene diferentes geometr&iacute;as, abre el registro de Track Designer y pulsa sobre la pieza. Si puedes ver m&aacute;s de una entrada bajo &quot;Geometries&quot;, deber&aacute;s asignar el valor &quot;true&quot; al <FONT CLASS="Important">campo HasSeveralGeometries</FONT>. Si este campo es &quot;false&quot;, BlueBrick usar&aacute; el port ID &quot;0&quot; como origen de la pieza al guardar el archivo. El valor por defecto es &quot;false&quot;.</P>

<CENTER><IMG SRC="../TrackDesignerRegistry1.png"></CENTER>

<P>El <FONT CLASS="Important">campo TDBitmapList</FONT> contiene una lista con todas las conexiones de una pieza Track Designer. Este campo  te permite reasignar los puntos de conexi&oacute;n a los puntos de conexi&oacute;n de BluBrick. En esta lista, simplemente coloca un <FONT CLASS="Important">campo TDBitmap</FONT> por cada punto de conexi&oacute;n de Track Designer; si la pieza BlueBrick tiene m&aacute;s puntos de conexi&oacute;n que la de Track Designer, ign&oacute;ralos. Si la pieza Track Designer tiene m&aacute;s puntos de conexi&oacute;n que la de BlueBrick, crealos y a&ntilde;&aacute;delos a la lista de puntos de conexi&oacute;n en el archivo XML de BlueBrick. Presta especial atenci&oacute;n al orden del <FONT CLASS="Important">campo TDBitmap</FONT>! Esto es importante ya que las entradas deben seguir el mismo orden que el orden de ID de bitmaps en el registro de Track Designer.</P>

<P>El  <FONT CLASS="Important">campo BBConnexionPointIndex</FONT> contiene el &iacute;ndice de conexiones con base 0 de BlueBrick, que indica c&oacute;mo la pieza conectar&aacute; e Track Designer al usar este &iacute;ndice de bitmaps. En la descripci&oacute;n de la pieza BlueBrick en el archivo XML, los puntos de conexi&oacute;n se describen dentro del campo ConnexionList (vea la secci&oacute;n sobre  c&oacute;mo <A HREF="Part_XML_Description_Connection.htm">Describir los puntos de conexi&oacute;n</A> para m&aacute;s detalles). El &iacute;ndice de conexiones BlueBrick se refiere al orden en el cual aparecen las conexiones.</P>

<P>El <FONT CLASS="Important">campo Type</FONT> contiene un valor &iacute;ntegro que describe el tipo de conexi&oacute;n en. Este n&uacute;mero puede tener un valor entre 0 y 20.
<UL>
	<LI>0 = Recta</LI>
	<LI>1 = Curva izquierda</LI>
	<LI>2 = Curva derecha</LI>
	<LI>3 = Divisi&oacute;n izquierda</LI>
	<LI>4 = Divisi&oacute;n derecha</LI>
	<LI>5 = Empalme izquierda</LI>
	<LI>6 = Empalme derecha</LI>
	<LI>7 = Uni&oacute;n izquierda</LI>
	<LI>8 = Uni&oacute;n izquierda</LI>
	<LI>9 = Cruce</LI>
	<LI>10 = Cruce en T</LI>
	<LI>11 = rampa de subida</LI>
	<LI>12 = rampa de bajada</LI>
	<LI>13 = Recta corta</LI>
	<LI>14 = Curva corta interior izquierda</LI>
	<LI>15 = Curva corta interior derecha</LI>
	<LI>16 = Curva corta exterior izquierda</LI>
	<LI>17 = Curva corta exterior derecha</LI>
	<LI>18 = Aguja izquierda inversa</LI>
	<LI>19 = Aguja derecha inversa</LI>
	<LI>20 = Custom</LI>
</UL></P>

<CENTER><IMG SRC="../TrackDesignerRegistry2.png"></CENTER>

<P>El <FONT CLASS="Important">campo AngleBetweenTDandBB</FONT> contiene un valor decimal que es la diferencia en &aacute;ngulo (en grados) entre la orientaci&oacute;n de piezas en BlueBrick y TrackDesigner.</P>

</BODY>
</HTML>
