<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alban Nanty">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>Formato de piezas</Title>
</HEAD>
<BODY>
<H1>Formato de piezas</H1>
<H2>Formato</H2>
<P>BlueBrick solo carga im&aacute;genes GIF que est&aacute;n en una carpeta dentro de la carpeta de piezas (vea <A HREF="Part_Library_Folders.htm">Organizaci&oacute;n de carpetas</A> para m&aacute;s detalles). La imagen GIF puede contener color transparente.</P>
<P>No importa la orientaci&oacute;n de la vista superior de la pieza en la imagen, pero para facilitar la integraci&oacute;n de tu pieza con LDraw, recomiendo usar la misma orientaci&oacute;n que la pieza LDraw. De lo contrario tendr&aacute;s que modificar el <A HREF="LDraw_Remaping_File.htm">archivo LDraw Remap file</A>.</P>

<H2>Escala</H2>
<P>La escala de una pieza es <FONT CLASS="Important">1 stud = 8 pixeles</FONT>. Como en realidad un stud iguala 8mm, otra manera de memorizar esta escala es 1 pixel = 1 mil&iacute;metro.</P>

<H2>Caracteres autorizados para nombrar archivos</H2>
<P>Los nombres de las piezas no son sensibles a may&uacute;sculas, ya que BlueBrick convierte todos los nombres a may&uacute;sculas al crear la biblioteca de piezas. Por lo tanto, si creas dos piezas con el mismo nombre, pero alguna letra en min&uacute;scula o may&uacute;scula, se considerar&aacute; como la misma pieza. Puedes usar cualquier car&aacute;cter autorizado para nombrar tu pieza (incluido espacios), pero recomiendo en&eacute;rgicamente usar solo caracteres ingleses para facilitar el compartir tu mapa de manera internacional. Evita tambi&eacute;n el uso del punto ya que este se usa para separar el nombre de un archivo de su extensi&oacute;n y BlueBrick lo emplea para separar el n&uacute;mero de una pieza de su color.</P>

<H2>Convenci&oacute;n de nombres de archivo</H2>
<P>A BlueBrick le d igual c&oacute;mo llamas tus piezas.  La &uacute;nica limitaci&oacute;n es que el nombre debe ser &uacute;nico dentro de la biblioteca entera. No puedes usar el mismo nombre para dos piezas, incluso si est&aacute;n en carpetas diferentes. Este nombre se convierte en el ID exclusivo que se guarda en el trazado BBM. Para evitar conflictos en la biblioteca y para hacer los archivos BBM portables, <FONT CLASS="Important">habitualmente se emplea el numero de la pieza o set como su nombre</FONT>. Esto simplemente es un uso com&uacute;n que recomiendo en&eacute;rgicamente que sigas. La biblioteca oficial de BlueBrick tambi&eacute;n seguir&aacute; este criterio.</P>

<H3>Convenci&oacute;n de nombres para sets.</H3>
<P>Como algunas piezas de Lego&copy; tienen el mismo n&uacute;mero que sets de Lego&copy; la npr&aacute;ctica com&uacute;n es la de a&ntilde;adir &quot;.set&quot; como sufijo al n&uacute;mero del set. No uses un sufijo num&eacute;rico (como &quot;.1&quot;) ya que ese sufijo se interpretar&aacute; como un color (vea m&aacute;s abajo para m&aacute;s detalles), y la informaci&oacute;n del color no es relevante para un set. Adem&aacute;s, Peeron y Bricklink pueden emplear un gui&oacute;n seguido de un n&uacute;mero para diferenciar piezas de sets y tambi&eacute;n diferentes sets producidos a lo largo del tiempo pueden tener el mismo n&uacute;mero. Por ello es recomendable usar este sufijo y emplaer los mismos n&uacute;meros que Peeron o Bricklink.</P>

<DIV class="TechNote">
<PRE><PRE>&lt;N&uacute;meroDeSet&gt;.set.gif
&lt;N&uacute;meroDeSet&gt;.set.xml

Por ejemplo la convenci&oacute;n para nombrar el set #2150 es:
<B>2150-1.set.gif</B>

Adem&aacute;s, si quieres separar un set en diferentes im&aacute;genes gif, puedes renombr&aacute;rlos de la siguiente manera:
6399-1.set1.gif
6399-1.set2.gif
6399-1.set3.gif
etc...

Si quieres hacer GIFs de modelos alternativos de LEGO que est&aacute;n contenidos dentro de un set, la convenci&oacute;n para nombrarlos es como sigue:
4886-1.setA.gif
4886-1.setB.gif
4886-1.setC.gif
etc...</PRE>
</DIV>

<H3>Convenci&oacute;n de nombres de piezas</H3>

<P>El est&aacute;ndar com&uacute;n para nombrar una pieza de LEGO&copy; es la de usar el n&uacute;mero completo de la pieza seguido de un punto, luego el c&oacute;digo de color seg&uacute;n la tabla de colores de LDraw y finalmente una extensi&oacute;n.</P>

<DIV class="TechNote">
<PRE>&lt;N&uacute;meroDePieza&gt;.&lt;Color&gt;.gif
&lt;N&uacute;meroDePieza&gt;.&lt;Color&gt;.xml

Por ejemplo, la convenci&oacute;n para nombrar un baseplate az&uacute;l 32x32 es:
<B>3811.1.gif</B>

<B>La tabla de color de LDraw es:</B>
  0 Black               28 Dark Tan               134 Pearl Copper
  1 Blue                29 Light Purple           135 Pearl Gray
  2 Green               33 Trans Blue             137 Pearl Sand Blue
  3 Teal                34 Trans Green            142 Pearl Gold
  4 Red                 36 Trans Red              151 Light Stone
  5 Dark Pink           37 Trans Violet           256 Rubber Black
  6 Brown               40 Trans Gray             272 Dark Blue
  7 Gray                41 Trans Light Cyan       273 Rubber Blue
  8 Dark Gray           42 Trans Flu Lime         288 Dark Green
  9 Light Blue          45 Trans Pink             313 Maersk Blue
 10 Bright Green        46 Trans Yellow           320 Dark Red
 11 Turquiose           47 Clear                  324 Rubber Red
 12 Light Red           57 Trans Flu Orange       334 Chrome Gold
 13 Pink                69 Bright Purple          335 Sand Red
 14 Yellow              70 Reddish Brown          366 Earth Orange
 15 White               71 Stone Gray             373 Sand Violet
 17 Light Green         72 Dark Stone Gray        375 Rubber Gray
 18 Light Yellow        73 Medium Blue            378 Sand Green
 19 Tan                 74 Medium Green           379 Sand Blue
 20 Light Violet        77 Paradisa Pink          383 Chrome Silver
 21 Phosphor White      78 Light Flesh            462 Light Orange
 22 Violet              79 Translucent White      484 Dark Orange
 23 Violet Blue         85 Medium Lilac           494 Electric Contact
 25 Orange              86 Dark Flesh             503 Light Gray
 26 Magenta             89 Royal Blue             511 Rubber White
 27 Lime                92 Flesh</PRE>
</DIV>

<H3>Convenci&oacute;n de nombres de grupos</H3>

<P>El nombre del archivo que describe un grupo de piezas (piezas hechas de piezas organizadas de una manera espec&iacute;fica), deber&iacute;a comenzar por un nombre que describe el grupo, seguido de un punto, la palabra &quot;group&quot; y finalmente la extensi&oacute;n. Piezas de grupo nunca tienen imagen gif, solo archivo xml. Si quieres hacer un grupo que representa un set (por ejemplo un set que incluye varios edificios en un formato predefinido), emplea la convenci&oacute;n para nombres de sets (vea arriba).</P>

<DIV class="TechNote">
<PRE>&lt;GroupName&gt;.group.xml

Por ejemplo, la convenci&oacute;n de nombre para una v&aacute;i flexible podr&iacute;a ser:
<B>flex.group.xml</B></PRE>
</DIV>

</BODY>
</HTML>
