<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta name="keywords" content="BlueBrick, Help">
<meta name="description" content="The reference documentation for BlueBrick.">
<meta name="author" content="Alex McKenna">
<link rel="StyleSheet" href="../BlueBrick.css" type="text/css" media="screen">
<Title>Preferencias generales</Title>
</head>
<body>
<H1>Preferencias generales</H1>
<center><img src="Preferences_General.png"></center>

<p>El <B>idioma del programa</B> <span class="RefNumber">3</span> se puede cambiar arriba a la izquierda. El cambio afectar&aacute; casi todo el texto del programa. Deber&aacute;s reiniciar BlueBrick para que los cambios tengan efecto.  Los elementos que no e ver&aacute;n afectados por el cambio son las pesta&ntilde;as encima del &aacute;rea de piezas y ventanas que est&aacute;n relacionadas directamente con el idioma de tu sistema operativo (por ejemplo la paleta de selecci&oacute;n colores).</p>

<p>The <b>Notifications</b> <span class="RefNumber">4</span> list some warning messages that can popup during the execution of BlueBrick. Since those warning messages can be repetitive, you can disable them by checking a "forget" checkbox. By default all the warning notifications are enabled. You can re-enable the notification messages you have chosen to ignore, or disable some notifications upfront.</P>

<p>La lista de <B>archivos recientes</B> <span class="RefNumber">5</span> tiene por defecto 4 entradas. El m&aacute;ximo son 20. Puedes borrar la lista usando el bot&oacute;n &quot;Borrar lista de archivos recientes&quot;. Esta acci&oacute;n no se puede deshacer.</p>

<p>La lista de <b>deshacer/rehacer</b> <span class="RefNumber">6</span> se puede ajustar. El n&uacute;mero m&aacute;ximo de acciones a deshacer es de 1000. El n&uacute;mero m&aacute;ximo de acciones mostradas es de 50. Nota que cuanto mayor sea el n&uacute;mero de acciones a deshacer que se graban, m&aacute;s memoria ocupar&aacute; el programa.</p>

<p>The <b>New Map Template</b> field <span class="RefNumber">7</span> let you specify a BBM file that should be used as a template whenever you create a new layout. To do that, first create a BBM file with the options you prefer, like the number and type of layers, the background color, your name as author, the logo of your LUG in one corner, etc... and save it somewhere on your hard drive. Then specify the path of that file in this field. Now on, every time you use the <span class="path">&nbsp;File > New&nbsp;</span> feature, a new layout will be created by using this file as the starting point.</p>

<p>Los ajustes de <b>rendimiento</b> <span class="RefNumber">8</span> pueden ser importantes para ordenadores m&aacute;s viejos. Por defecto est&aacute; seleccionada la opci&oacute;n &quot;m&aacute;s r&aacute;pido&quot;. Puedes seleccionar la opci&oacute;n &quot;Menos memoria&quot; si notas que el sistema se hace inestable durante su uso. La mayor&iacute;a de ordenadores deber&iacute;an poder usar los modos &quot;equilibrado&quot; o m&aacute;s r&aacute;pido&quot;</p>

</body>
</html>
