<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alex McKenna">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>Seleccionar piezas</Title>
</HEAD>
<BODY>
<H1>Seleccionar piezas</H1>

<P>Selecci&oacute;n general funciona igual en las capas de ladrillos y de texto Puedes seleccionar piezas individuales haciendo clic sobre ellas, o m&uacute;ltiples piezas arrastrando el puntero sobre las piezas que deseas (creando un rect&aacute;ngulo de selecci&oacute;n). La manera en que se remarcan las piezas seleccionadas se puede modificar en la pesta&ntilde;a &quot;Apariencia&quot; en <A HREF="Appearance_Options.htm">Opciones globales</A>.</P>

<P>Se pueden seleccionar m&uacute;ltiples piezas <FONT CLASS="Important">presionando la tecla CTRL</FONT> (por defecto), y haciendo clic sobre las piezas con el bot&oacute;n izquierdo del rat&oacute;n. Mantener pulsado el bot&oacute;n CTRL y pulsar sobre una pieza ya seleccionada la deseleccionar&aacute;.</P>

<P>Tambi&eacute;n puedes seleccionar un grupo de piezas pulsando el bot&oacute;n izquierdo del rat&oacute;n y arrastr&aacute;ndolo para que las piezas deseadas queden dentro del rect&aacute;ngulo de selecci&oacute;n. Puedes hacer m&uacute;ltiples selecciones de grupos pulsando la tecla CTRL (por defecto) al crear rect&aacute;ngulos de selecci&oacute;n adicionales. SI no mantienes pulsado la tecla CTRL el rect&aacute;ngulo de selecci&oacute;n anterior desaparecer&aacute;.  Si dos rect&aacute;ngulos de selecci&oacute;n que no contienen las mismas piezas se solapan, todas las piezas se unir&aacute;n en un &uacute;nico rect&aacute;ngulo de selecci&oacute;n. Arrastrar un rect&aacute;ngulo de selecci&oacute;n sobre piezas seleccionadas las deseleccionar&aacute;.</P>
</BODY>
</HTML>
