<html>
<head>
<META HTTP-EQUIV="content-type" CONTENT="text/html; charset=utf-8">
<meta name="keywords" content="BlueBrick, Help">
<meta name="description" content="The reference documentation for BlueBrick.">
<meta name="author" content="Alex McKenna">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>&Aacute;reas de la ventana</Title>
</head>
<body>
<H1>&Aacute;reas de la ventana</H1>
<P>La ventana de BlueBrick tiene 3 &aacute;reas: el &aacute;rea de trazado, el &aacute;rea de piezas y el &aacute;rea de datos del mapa. El uso de estas &aacute;reas se explica con m&aacute;s detalle en la secci&oacute;n <A HREF="Creating_and_Modifying_Models.htm">Crear y modificar modelos</A>.</P>

<CENTER><IMG SRC="Software_Overview_Window_Panes.png"></CENTER>

<H2>El &aacute;rea de trazado</H2>
<P>El &aacute;rea de trazado ocupa la parte izquierda de la pantalla y se reconoce por su fondo azul con cuadr&iacute;cula blanca (por defecto). Este &aacute;rea tiene una herramienta modificable de &quot;ajuste a la cuadr&iacute;cula&quot; que te ayudar&aacute; a ajustar diferentes elementos en tu trazado.</P>

<H2>El &aacute;rea de piezas </H2>
<P>El &aacute;rea de piezas se encuentra en la esquina superior derecha de la ventana principal y consiste en varias pesta&ntilde;as de categor&iacute;as en las que las piezas est&aacute;n organizadas. Si deseas contribuir a la lista de piezas por favor <A HREF="https://www.eurobricks.com/forum/index.php?showtopic=33157">pulsa aqu&iacute;</A>. En la actualidad la pesta&ntilde;a &quot;Custom&quot; contiene 3 diferentes tama&ntilde;os de mesas. Los tama&ntilde;os representan el n&uacute;mero de baseplates de 32x32 que caben en la superficie.</P>

<H2>El &aacute;rea de datos del mapa</H2>
<P>Este panel está situado en la esquina inferior derecha y tiene tres pestañas. La primera pestaña muestra las capas, la segunda pestaña muestra el uso de las piezas y la última pestaña muestra alguna información general sobre el mapa. La función de capas es especialmente útil para diseños más complicados. En esta pestaña se pueden añadir, eliminar y organizar las distintas capas que se necesiten. Los detalles se pueden encontrar en la sección <a href="Creating_Using_Layers.htm">Creación y uso de capas</a>. La pestaña de uso de las partes muestra la lista de todas las partes utilizadas en el mapa, y eventualmente el porcentaje de uso en relación con el presupuesto. La última pestaña le permite añadir alguna información relativa a su mapa.</p>

</body>
</html>
