<HTML>
<HEAD>
<META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">
<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alex McKenna">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>P&aacute;gina de inicio</Title>
</HEAD>
<BODY>
<CENTER>
<TABLE><TR>
	<TD><IMG SRC="../Logo.png"></TD>
	<TD><FONT SIZE="16em">BlueBrick<BR></font>
	<FONT SIZE="5em">Versi&oacute;n 1.9.0<BR>
	<BR></font>
	por Alban Nanty</TD>
</TR></TABLE>
</CENTER>
<BR>
<P>BlueBrick es un programa gratu&iacute;to para Windows desarrollado por Alban Nanty como c&oacute;digo abierto. Puedes usarlo para tus proyectos personales, pero no para uso comercial. Este programa se distribuye con la esperanza de que sea de utilidad, pero SIN NINGUNA GARANT&iacute;A.</P>
<P>Este programa se dise&ntilde;&oacute; especialmente para los AFOLs que quieren preparar trazados para exposiciones  LEGO®. BlueBrick es compatible con <a href="https://www.ldraw.org/" target="_blank">LDRAW</a>, <a href="http://members.home.nl/john.hielema/tracks/td.htm" target="_blank">Train Depot Track Designer</a> y <a href="https://www.4dbrix.com/" target="_blank">4DBrix nControl</a> y se dise&ntilde;&oacute; para extender su base de piezas de manera sencilla. Su trabajo por capas permite una mejor organizaci&oacute;n de tu dise&ntilde;o, y algunas capas espec&iacute;ficas permiten a&ntilde;adir anotaciones y asignaci&oacute;n de &aacute;reas.</P>
<CENTER>
  <DIV CLASS="LegalNotice">BlueBrick es un programa de c&oacute;digo abierto: puedes redistribuirlo bajo los t&eacute;rminos de la Licencia General P&uacute;blica GNU versi&oacute;n 3<BR>
    publicadas por la  Free Software Foundation.<BR> Vea <A HREF="https://www.fsf.org/licensing/licenses/gpl.html">https://www.fsf.org/licensing/licenses/gpl.html</A><BR> y <A HREF="https://www.gnu.org/licenses/">https://www.gnu.org/licenses/</A></DIV>
<BR>
<DIV CLASS="DocAuthor">Esta documentaci&oacute;n fue escrita en ingl&eacute;s principalmente por Alexander McKenna con alg&uacute;n a&ntilde;adido de Alban Nanty. <br>
  La traducci&oacute;n 
  inicial al espa&ntilde;ol  fue realizada por Jetro de Ch&acirc;teau y  ha sido ampliada a la versi&oacute;n actual del programa por Miguel Pulido.</DIV>
</CENTER>
</BODY>
</HTML>
