<HTML>
<HEAD>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

<META NAME="keywords" CONTENT="BlueBrick, Help">
<META NAME="description" CONTENT="The reference documentation for BlueBrick.">
<META NAME="author" CONTENT="Alex McKenna">
<LINK REL=StyleSheet HREF="../BlueBrick.css" TYPE="text/css" MEDIA=screen>
<Title>&Aacute;reas de la ventana</Title>
</HEAD>
<BODY>
<H1>&Aacute;reas de la ventana</H1>
<P>La ventana de BlueBrick tiene 3 &aacute;reas: el &aacute;rea de trazado, el &aacute;rea de piezas y el &aacute;rea de capas. El uso de estas &aacute;reas se explica con m&aacute;s detalle en la secci&oacute;n <A HREF="Creating_and_Modifying_Models.htm">Crear y modificar modelos</A>.</P>

<CENTER><IMG SRC="WindowPanes.png"></CENTER>

<H2>El &aacute;rea de trazado</H2>
<P>El &aacute;rea de trazado ocupa la parte izquierda de la pantalla y se reconoce por su fondo azul con cuadr&iacute;cula blanca (por defecto). Este &aacute;rea tiene una herramienta modificable de &quot;ajuste a la cuadr&iacute;cula&quot; que te ayudar&aacute; a ajustar diferentes elementos en tu trazado.</P>

<H2>El &aacute;rea de piezas </H2>
<P>El &aacute;rea de piezas se encuentra en la esquina superior derecha de la ventana principal y consiste en varias pesta&ntilde;as de categor&iacute;as en las que las piezas est&aacute;n organizadas. Si deseas contribuir a la lista de piezas por favor <A HREF="http://www.eurobricks.com/forum/index.php?showtopic=33157">pulsa aqu&iacute;</A>. En la actualidad la pesta&ntilde;a &quot;Custom&quot; contiene 3 diferentes tama&ntilde;os de mesas. Los tama&ntilde;os representan el n&uacute;mero de baseplates de 32x32 que caben en la superficie.</P>

<H2>La &aacute;rea de capas</H2>
<P>El &aacute;rea de capas se encuentra en la esquina inferior derecha. Esta herramienta es especialmente pr&aacute;ctica para trazado complejos. En este &aacute;rea puedes a&ntilde;adir, eliminar y organizar las diferentes capas que necesites. Se pueden encontrar m&aacute;s detalles en la secci&oacute;n <A HREF="Creating_and_Using_Layers.htm">Crear y usar capas</A>.</P>

</BODY>
</HTML>
